Repository: hakuna-m/wubiuefi
Catalog: po/*.po
Languages: ar, ast, bg, ca, cs, de, fi, gl, he, hr, hu, id, it, lt, ms, nb, nl, pl, pt, ru, sk, sq, th, ur, zh_cn, zh_tw

source: Try %(distro)s without installing! Simply reboot your machine with the CD in the tray. You may perform a full installation from within the demo to install %(distro)s either alongside Windows or as the only operating system.
ar: جرب %(distro)s بدون تثبيت! بكل بساطة أعِد تشغيل الجهاز مع إبقاء الاسطوانة المدمجة داخل طبق قارئ الاسطوانات. ومن داخل العرض التجريبي يمكنك تنفيذ عملية التثبيت الكاملة وتثبيت %(distro)s إما مجاوراً لنظام التشغيل وندوز أو كنظام التشغيل الوحيد.
ast: ¡Prueba %(distro)s ensin instalalu! Simplemente reentama'l to equipu col CD dientro de la unidá. Puedes facer una instalación completa dende dientro de la demo pa instalar %(distro)s xunto a Windows, o como sistema operativu únicu.
bg: Пробвайте %(distro)s без да го инсталирате! Просто рестартирайте вашия компютър с диска в дисковото устройство. Можете да извършите пълна инсталация от демонстрацията или да инсталирате %(distro)s заедно с Windows или като единствена операционна система.
ca: Proveu %(distro) sense haver d'instal·lar res. Simplement reinicieu l'ordinador amb el CD a la safata. Podeu dur a terme una instal·lació dins de la demostració, de manera que pugueu instal·lar %(distro)s o bé paral·lelament amb el Windows o com a únic sistema operatiu.
cs: Vyzkoušejte %(distro)s bez instalace! Jednoduše restartujte váš počítač s CD v mechanice. Můžete provést plnou instalaci z ukázkové verze a nainstalovat %(distro)s buď společně s Windows nebo jako jediný operační systém.
de: Testen Sie %(distro)s ohne Installation! Starten Sie einfach mit der CD im Laufwerk Ihren Rechner neu. Sie können eine vollständige Installation aus der Vorführung heraus starten, um %(distro)s entweder parallel zu Windows oder als einziges Betriebssystem zu installieren.
fi: Kokeile asentamatta. Käynnistä vain tietokone uudelleen CD-levyn ollessa asemassa, niin %(distro)s käynnistyy. Esittelytilasta voi tehdä täyden %(distro)s-asennuksen joko Windowsin rinnalle tai ainoaksi käyttöjärjestelmäksi.
gl: Probe %(distro)s sen instalar! Simplemente reinicie o seu computador co CD na bandexa. Pode realizar unha instalación completa a partir da demo que instalará %(distro)s ben xunto con Windows ou ben como único sistema operativo.
he: ניתן לנסות את %(distro)s ללא צורך בהתקנה! פשוט עליך לאתחל את המחשב עם התקליטור בכונן. ניתן לבצע התקנה מלאה מתוך ההדגמה ולהתקין את %(distro)s או לצד Windows או כמערכת ההפעלה היחידה.
hr: Isprobajte %(distro)s bez instalacije! Jednostavno ponovno pokrenite računalo s CD-om u računalu. Potpunu instalaciju možete pokrenuti iz demonstracije kako biste %(distro)s instalirali uz Windowse ili kao jedini operativni sustav.
hu: Próbálja ki a(z) %(distro)s rendszert telepítés nélkül! Egyszerűen indítsa újra a gépét a tálcába helyezett CD-vel. Végrehajthatja a teljes telepítést a bemutatóból; a(z) %(distro)s telepíthető a Windows mellé vagy egyedüli operációs rendszerként.
id: Coba %(distro)s tanpa perlu menginstal! Cukup reboot komputer Anda dengan CD berada di dalam CD-ROM. Anda dapat juga melakukan instalasi penuh pada saat demo untuk menginstal %(distro)s berdampingan dengan Windows atau sebagai satu-satunya sistem operasi.
it: Consente di provare %(distro)s senza eseguire l'installazione: basta riavviare il computer con il CD inserito nel lettore. Sarà possibile eseguire un'installazione completa di %(distro)s a fianco di Windows o come sistema operativo principale dalla versione in prova.
lt: Išmėginkite %(distro)s be diegimo! Paprasčiausiai įkraukite OS iš naujo palikę CD dėkle. Jūs galite atlikti pilną %(distro)s diegimą greta Windows, arba kaip vienintelę operacinę sistemą iš demonstracijos.
ms: Cuba %(distro)s tanpa memasangnya! Hanya mulakan kembali komputer anda dengan CD berada dalam bekasnya. Nada boleh lakukan pemasangan sepenuhnya dari demo tersebut untuk memasang %(distro)s sama ada dipasang disamping Windows atau sebagai sistem operasi komputer ini.
nb: Prøv %(distro)s uten innstallasjon! Bare start maskinen på nytt på CDen i. Du kan utføre en full innstallasjon fra demoen for å innstallere %(distro)s enten ved siden av Windows, eller som det eneste operativsystemet.
nl: Probeer %(distro)s zonder installatie! Herstart gewoon uw computer met de cd in de lade. U kunt een volledige installatie vanuit de demo uitvoeren, om %(distro)s naast Windows of als enige besturingssysteem te installeren.
pl: Wypróbuj %(distro)s bez instalacji! Wystarczy uruchomić ponownie komputer z płytą CD w napędzie. Można dokonać pełnej instalacji %(distro)s obok systemu WIndows lub jako jedyny system podczas demonstracji.
pt: Experimente %(distro)s sem instalar! Simplesmente reinicie o seu computador com o CD na drive de discos. Poderá realizar uma instalação completa enquanto estiver no ambiente de demonstração para instalar %(distro)s partilhando o disco com o Windows ou como único sistema operativo.
ru: Попробуйте %(distro)s без установки! Просто перезагрузите ваш компьютер с этим диском в приводе. Вы сможете запустить полную установку из демо-режима и установить %(distro)s параллельно с Windows или как единственную операционную систему.
sk: Skúste %(distro)s bez inštalácie! Jednoducho reštartujte svoj počítač s CD v mechanike. Môžete vykonať plnú inštaláciu zo skúšobnej a nainštalovať %(distro)s buď spolu s Windows alebo ako jediný operačný systém.
th: ทดลอง %(distro)s โดยปราศจากการติดตั้ง! เพียงเริ่มระบบใหม่โดยปล่อยซีดีไว้ในถาด คุณสามารถดำเนินการติดตั้งอย่างเต็มรูปแบบจากตัวทดลอง %(distro)s ควบคู่ไปกับ Windows หรือติดตั้งเพียงระบบปฏิบัติเดียว
ur: %(distro)s کو نصب کئے بغیر استعمال کریں! صرف سی ڈی کو ٹرے میں رکھے ہوئے کمپیوٹر دوبارہ چلائیں۔ آپ %(distro)s کی مکمل تنصیب ڈیمو میں سے چلا سکتے ہیں، چاہے ونڈوز کے ساتھ یا اکیلا آپریٹنگ سسٹم کے طور پر۔
zh_cn: 不安装，直接试用 %(distro)s！把光盘放进光驱，重启动电脑。然后您可以从演示里进行 %(distro)s 的完整安装， 可以安装到 Windows 操作系统的某个分区里，也可以作为电脑上唯一的操作系统。
zh_tw: 試用 %(distro)s 而不需安裝！只要以光碟機內的 CD 重新開機。您可以從展示系統中執行完整安裝，可以安裝 %(distro)s 並且和 Windows 並存，或是作為您唯一的作業系統。

source: Install inside Windows
ar: ثبت داخل وندوز
ast: Instalar dientro de Windows
bg: Инсталиране вътре в Windows
ca: Instal·la dins del Windows
cs: Instalace ve Windows
de: Innerhalb von Windows installieren
fi: Asenna Windowsin sisälle
gl: Instalar dentro de Windows
he: התקנה בתוך Windows
hr: Instaliraj unutar Windowsa
hu: Telepítés a Windows-on belül
id: Instal di dalam Windows
it: Installa dentro Windows
lt: Įdiegti į Windows
ms: Pasang dalam Windows
nb: Innstaller i Windows
nl: Binnen Windows installeren
pl: Instalacja wewnątrz Windows
pt: Instalar dentro do Windows
ru: Установка из-под Windows
sk: Inštalovať do Windows
sq: Instaloje në brendësi të Windows
th: ติดตั้งไว้ใน Windows
ur: ونڈوز کے اندر تنصیب
zh_cn: 在 Windows 中安装
zh_tw: 安裝在 Windows 內

source: Install and uninstall %(distro)s like any other application, without the need for a dedicated partition. You will be able to boot into either Windows or %(distro)s. Hibernation is not enabled in this mode and disk performance is slightly reduced.
ar: ثبت وأزل تثبيت %(distro)s مثل أي تطبيق آخر بدون الحاجة إلى قِسم مخصص على القرص الصلب، و سيكون بمقدورك الإقلاع إلى أي من نظام التشغيل وندوز أو %(distro)s. علماً بان الإسبات لا يعمل في هذا النمط وأداء القرص منخفض قليلاً.
ast: Instalar y desinstalar %(distro)s como cualquier otra aplicación, ensin necesidá d'una partición dedicada. Podrás arrancar Windows o %(distro)s. Nesti mou nun ta activada la hibernación, y les prestaciones del discu tan un poco amenorgáes .
bg: Инсталирайте и деинсталирайте %(distro)s като всяка друга програма без да ви трябва отделен дял. Ще можете да стартирате или Windows или %(distro)s. В този режим хибернацията е забранена и производителността на диска малко е понижена.
ca: Instal·leu i desinstal·leu %(distro)s com si fos una aplicació normal i sense haver d'utilitzar cap partició per a aquesta. Podreu arrencar en el Windows o bé en %(distro)s, tot i que la hibernació no s'habilitarà i el rendiment serà lleugerament inferior.
cs: Nainstaluje a odstraní %(distro)s jako jakoukoliv jinou aplikaci bez nutnosti vyhrazeného oddílu. Při spouštění budete mít možnost zvolit mezi Windows a %(distro)s. V tomto režimu není možné používat uspání na disk a výkon disku je mírně snížen.
de: Installieren und deinstallieren Sie %(distro)s wie jede andere Anwendung, ohne eine eigene Partition auf der Festplatte. Sie werden dann sowohl Windows als auch zu %(distro)s starten können. Der Ruhezustand ist in diesem Modus ausgeschaltet und die Festplattenleistung etwas reduziert.
fi: Asenna ja poista %(distro)s samalla tavalla kuin mikä tahansa sovellus, ilman erityisen osion varaamista. Voit valita, käynnistetäänkö Windows vai %(distro)s. Lepotila ei ole käytettävissä tässä tilassa, ja järjestelmän nopeus kärsii hieman.
gl: Instala e desinstala %(distro)s como calquer outro aplicativo, sen a necesidade dunha partición dedicada. Poderá iniciar ben en Windows ou ben en %(distro)s. A hibernación non está activada neste modo e o rendemento redúcese un chisco.
he: ניתן להתקין ולהסיר את %(distro)s כמו כל יישום אחר, ללא כל צורך בהקדשת מחיצה למטרה זו. ניתן יהיה לאתחל לתוך Windows או לתוך %(distro)s. לא ניתן להפעיל את מצב השינה בצורת הפעלה זו ויכולות הכונן מופחתות מעט.
hr: Instalirajte i uklonite %(distro)s kao bilo koju drugu aplikaciju, bez potrebe za zasebnom particijom. Moći ćete odabrati želite li instalirati Windowse ili %(distro)s. Hibernacija nije uključena u ovom načinu rada, a performanse diska je neznatno lošije.
hu: A(z) %(distro)s telepítése és eltávolítása a többi alkalmazáshoz hasonlóan, kijelölt partíció szükségessége nélkül. Egyaránt lehetősége lesz a Windows vagy a(z) %(distro)s indítására. A hibernálás nem engedélyezett ebben a módban és a lemez teljesítménye némileg csökken.
id: Pasang dan bongkar %(distro)s seperti aplikasi lainnya, tanpa menggunakan partisi tersendiri. Anda akan bisa boot melalui Windows atau %(distro)s. Hibernasi tak bisa dilakukan dalam mode ini dan kinerja disk akan sedikit menurun.
it: Installa e rimuove %(distro)s come qualsiasi altra applicazione, senza la necessità di utilizzare dello spazio dedicato sul disco. Sarà possibile avviare Windows o %(distro)s. L'ibernazione non è abilitata in questa modalità e le prestazioni risultano leggermente ridotte.
lt: Įdiekite ir šalinkite %(distro)s kaip bet kokią kitą programą be specialaus disko skirsnio. Jūs galėsite paleisti arba Windows, arba %(distro)s. Užmigdymas šiame režime neįjungtas, o disko našumas truputį sumažėjęs.
ms: Pasang dan nyahpasang %(distro)s seperti mana perisian lain, tanpa menggunakan bahagian cakera keras. Anda akan dapat masuk kepada Windows atau %(distro)s. Hibernasi tidak diaktifkan dalam mod ini dan kemampuan cakera adalah berkurang.
nb: Innstaller and avinnstaller %(distro)s som en hvilken som helst annen applikasjon, uten behovet for en dedikert partisjon. Du kan starte opp maskinen med enten Windows eller %(distro)s. Dvalemodus er ikke tilgjengelig i denne modusen og diskytelsen er litt redusert.
nl: Installeer en verwijder %(distro)s net als elk ander programma, zonder een speciale partitie nodig te hebben. U zult de keuze hebben om op te starten in Windows of in %(distro)s. Slaapstand is niet ingeschakeld in deze modus en schijfprestaties zijn iets verminderd.
pt: Instale e desinstale %(distro)s como qualquer outra aplicação, sem a necessidade de uma partição dedicada. Irá então ser possível fazer o arranque do Windows ou do %(distro)s. A hibernação do sistema não será possível neste modo e a performance do disco rígido será ligeiramente mais reduzida.
ru: Установка и удаление %(distro)s происходит как и любого другого приложения, без необходимости создания отдельного раздела. Вы сможете запустить как Windows, так и %(distro)s. В этом режиме отсутствует спящий режим и производительность диска слегка уменьшена.
sk: Inštalovať a odinštalovať %(distro)s ako ostatné aplikácie, bez potreby oddeleného oddielu. Budete schopný spustiť Windows alebo %(distro)s. V tomto režime nie je povolená hibernácia a výkon disku môže byť mierne znížený.
th: ติดตั้งและถอดถอน %(distro)s เหมือนกับโปรแกรมอื่น โดยไม่จำเป็นต้องมีพาร์ทิชันให้ คุณสามารถบูตเข้าสู่ Windows หรือ %(distro)s ได้ โหมดจำศีลจะไม่สามารถใช้งานได้ และประสิทธิภาพการใช้งานดิสก์จะลดลงเล็กน้อย
ur: %(distro)s کی تنصیب اور غیرتنصیب کسی بھی دوسری ایپلی کیشن کی طرح ہے، بغیر مختص پارٹیشن کی ضرورت کے۔ آپ ونڈوز یا %(distro)s میں بوٹ کر سکے گے۔ اس موڈ میں ہائبرنیشن غیر فعال اور ڈسک کی کارکردگی تھوڑا سا کم ہو گی۔
zh_cn: 安装和卸载 %(distro)s 就像其它程序一样，不需要一个专用的分区。您也可以选择进入 Windows 或者 %(distro)s。在这种模式下，不支持休眠功能，磁盘性能稍微有一点降低。
zh_tw: 像其它應用程式一樣安裝與解除安裝 %(distro)s，而不需要特地設置分割區。您可以開機進入 Windows 或 %(distro)s。在此模式下不會啟用休眠功能，而且會稍微降低磁碟效能。

source: Learn more
ar: اعرف المزيد
ast: Pa saber más
bg: Научете повече
ca: Obteniu més informació
cs: Další informace
de: Erfahren Sie mehr
fi: Lue lisää
gl: Saber máis
he: מידע נוסף
hr: Saznaj više
hu: Tudjon meg többet
id: Pelajari lagi
it: Ulteriori informazioni
lt: Sužinokite daugiau
ms: Pelajari lebih lanjut
nb: Lær mer
nl: Meer informatie
pl: Dowiedz się więcej
pt: Saber mais
ru: Узнать больше
sk: Dozvedieť sa viac
sq: Mëso më tepër
th: เรียนรู้เพิ่มเติม
ur: مزید معلومات حاصل کریں
zh_cn: 了解更多
zh_tw: 知道多一點

source: %(distro)s is a free, community developed, linux-based operating system complete with a web browser, productivity software, instant messaging, and much more.
ar: يعد %(distro)s نظام تشغيل حر مطور من المجتمع ومبني على نظام لينكس ومشتمل على متصفح وِب كامل و برمجيات إنتاجية و برامج دردشة فورية والكثير.
ast: %(distro)s ye un sistema operativu llibre, desarrollado por la comunidad, basáu en Linux que vien completáu con ñavegador web, software pal trabayu, mensaxería instantánea y muncho más.
bg: %(distro)s е безплатна, разработвана от обществото, Linux базирана операционна система с уеб браузър, софтуер за продуктивност, внезапни съобщения и още много.
ca: %(distro)s és un sistema operatiu basat en el Linux, lliure i desenvolupat per la comunitat, totalment complet i que inclou un navegador web, aplicacions ofimàtiques, missatgeria instantània i molt més.
cs: %(distro)s je zdarma dostupný, komunitou vyvíjený, na Linuxu založený operační systém včetně webového prohlížeče, kancelářského software, komunikátoru a mnoho dalšího.
de: %(distro)s ist ein freies, von einer Gemeinschaft entwickeltes, Linux-basiertes Betriebssystem, komplett mit einem Webbrowser, Produktivsoftware, Sofortnachrichtenprogrammen und vielem mehr.
fi: %(distro)s on vapaa, yhteisön kehittämä Linux-pohjainen käyttöjärjestelmä, joka sisältää myös WWW-selaimen, toimisto-ohjelmat, pikaviestimen ja paljon muuta.
gl: %(distro)s é un sistema operativo completo baseado en Linux, libre e desenvolvido pola comunidade que conta cun navegador, programas de produtividade, mensaxaría instantánea e moito máis.
he: %(distro)s הינה מערכת הפעלה חופשית, מפותחת על ידי קהילה, המבוססת על לינוקס ומכילה דפדפן אינטרנט, תוכנות הפקה, מסרים מידיים ועוד תכונות רבות.
hr: %(distro)s je besplatan operativni sustav razvijan od strane zajednice, opremljen s web preglednikom, programima za produktivnost, instantno dopisivanje i mnogo više.
hu: A(z) %(distro)s egy szabad, közösségi fejlesztésű, Linux-alapú teljes operációs rendszer, webböngészővel, irodai szoftverekkel, azonnali üzenetküldéssel, és sok egyébbel.
id: %(distro)s adalah sistem operasi lengkap berbasis linux, bebas, dikelola oleh komunitas yang di dalamnya terdapat peramban web, perangkat lunak untuk produktifitas, pesan singkat dan masih banyak lagi.
it: %(distro)s è un sistema operativo libero, basato su Linux e sviluppato dalla comunità dotato di browser web, programmi per la produttività, per la messaggistica istantanea e molto altro.
lt: %(distro)s yra nemokama, bendruomenės kuriama, Linux paremta operacinė sistema su žiniatinklio naršykle, našumo programine įranga, žinučių siuntimu ir daug daugiau.
ms: %(distro)s adalah percuma, dihasilkan oleh Komuniti, sistem pengoperasian berasaskan linux lengkap dengan pelayar web, perisian produktiviti, mesej segera dan banyak lagi.
nb: %(distro)s er en gratis, felleskapsutviklet , linuxbasert operativsystem komplett med en nettleser, produktivitestprogramvare, lynmeldinger, og mye mer.
nl: %(distro)s is een gratis, gemeenschappelijk ontwikkeld, Linux-gebaseerd besturingsysteem, compleet met een webbrowser, productiviteitssoftware, chatten en nog veel meer.
pl: %(distro)s jest darmowym, rozwijanym przez społeczność systemem operacyjnym opartym na Linuksie. Zawiera kompletny zestaw oprogramowania - przeglądarkę internetową, programy biurowe, komunikator i wiele więcej.
pt: %(distro)s é um sistema operativo livre, desenvolvido pela comunidade e baseado em linux complementado com um navegador web, software de produtividade, de mensagens instantâneas e muito mais.
ru: %(distro)s — это свободная, разрабатываемая сообществом операционная система на основе ядра Linux, укомплектованная веб-браузером, офисным пакетом, программой обмена мгновенными сообщениями и многим другим.
sk: %(distro)s je slobodný, komunitou vyvíjaný operačný systém založený na Linuxe doplnený internetovým prehliadačom, kancelárskym softvérom, internetovým komunikátorom a mnohým ďalším.
th: %(distro)s นั้นเสรี พัฒนาโดยชุมชน เป็นระบบปฏิบัติการที่มีรากฐานมาจากลินุกซ์ มีพร้อมซึ่งโปรแกรมท่องเว็บ ซอฟต์แวร์เพื่อการทำงาน ตัวส่งข้อความด่วน และอื่น ๆ อีกมากมาย
ur: %(distro)s ایک مفت، کمیونٹی تیار کردہ، لینکس بنیاد آپریٹنگ سسٹم ہے جو ویب براؤزر، پروڈکٹیو سوفٹ ویئر، فوری پیغام رسانی کے ساتھ ساتھ اور بہت کچھ مہیا کرتا ہے۔
zh_cn: %(distro)s 是一个由社区开发的基于 Linux 的自由操作系统，它带有网页浏览器、生产软件、即时消息等许多软件。
zh_tw: %(distro)s 是一套自由的、社群開發的，以 Linux 為基礎並附有網頁瀏覽器、辦公軟體、即時通訊等等的作業系統。

source: %s CD Boot Helper
ar: مساعد إقلاع الاسطوانة %s
ast: Ayudante del cargador del CD de %s
bg: %s CD помощник за стартиране
ca: Auxiliar d'arrencada del CD de %s
cs: Pomocník pro zavedení z CD %s
de: %s CD-Boothelfer
fi: %s - CD-levyltä käynnistämisen aputyökalu
gl: %s auxiliar de inicio de CD
he: מסייע האתחול של תקליטור %s
hr: %s pomoćnik učitavanja s CD-a
hu: %s CD-indítási segéd
id: CD Boot Helper %s
it: Assistente avvio CD di %s
lt: %s CD paleidimo pagelbiklis
ms: %s Pembantu Mula CD
nb: %s CD oppstartshjelper
nl: %s cd-opstarthelper
pt: %s Assistente de Arranque pelo CD
ru: %s помощник CD-загрузки
sk: Pomocník zavádzača CD %s
sq: %s CD Ndihmës Nisjeje
th: ตัวช่วยบูตซีดี %s
ur: %s سی ڈی بوٹ مددگار
zh_cn: %s 光盘启动帮助程序
zh_tw: %s CD 開機幫助程式

source: Not enough disk space to proceed
ar: لا توجد مساحة كافية على القرص للمواصلة
ast: Nun hai espaciu abondu en discu pa siguir
bg: Няма достатъчно място за продължаване
ca: No hi ha prou espai per a continuar
cs: Pro pokračování není na disku dostatek místa
de: Nicht genug freier Speicherplatz zum Fortsetzen
fi: Ei riittävästi levytilaa, jotta voitaisiin jatkaa
gl: Non hai disco abondo para proceder
he: אין די שטח פנוי בכונן להמשך
hr: Nedovoljno slobodnog prostora za nastavak
hu: Nincs elég lemezterület a folytatáshoz
id: Tidak cukup ruang disk untuk melanjutkan
it: Spazio su disco insufficiente per procedere
lt: Neužtenka vietos diske tęsti toliau
ms: Ruangan dalam cakera keras anda tidak cukup untuk meneruskan
nb: Ikke nok diskplass til å fortsette
nl: Te weinig vrije schijfruimte om door te gaan
pl: Za mało miejsca na dysku, aby kontynuować
pt: Não existe espaço suficiente em disco para prosseguir
ru: Для продолжения не хватает дискового пространства
sk: Nedostatok miesta na disku pre pokračovanie
sq: Nuk ka hapësirë sa duhet në disk për të vazhduar
th: ไม่มีพื้นที่ดิสก์ว่างพอต่อการดำเนินการ
ur: کاروائی آگے بڑھانے کے لیے ڈسک کی جگہ ناکافی ہے
zh_cn: 没有足够的磁盘空间进行操作
zh_tw: 沒有足夠磁碟空間以繼續

source: Install CD boot helper
ar: ثبت مساعد إقلاع الاسطوانات
ast: Instalar l'ayudante del cargador del CD
bg: Инсталиране на CD помощник за стартиране
ca: Instal·la l'auxiliar d'arrencada del CD
cs: Nainstalovat pomocníka pro zavedení z CD
de: CD-Boothelfer wird installiert
fi: Asenna CD-levyltä käynnistämisen aputyökalu
gl: Instalar o auxiliar de inicio de CD
he: מסייע האתחול של תקליטור ההתקנה
hr: Instaliraj pomoćnika učitavanja s CD-a
hu: Telepítő CD-indítási segéd
id: Instal CD boot helper
it: Installa assistente avvio CD
lt: Įdiegti CD paleidimo pagelbiklį
ms: Pasang pembantu Mula CD
nb: Innstaller CD oppstartshjelper
nl: Cd-opstarthelper installeren
pt: Instalar Assistente de arranque pelo CD
ru: Установить помощника CD-загрузки
sk: Inštalovať pomocníka zavádzača CD
sq: Instalo ndihmën e nisjes
th: ติดตั้งตัวช่วยบูตซีดี
ur: سی ڈی بوٹ مدد گار کی تنصیب
zh_cn: 安装光盘启动帮助程序
zh_tw: 安裝 CD 開機幫助程式
