Repository: hakuna-m/wubiuefi
Catalog: po/*.po
Languages: ar, ast, bg, ca, cs, de, fi, gl, he, hr, hu, id, it, lt, ms, nb, nl, pl, pt, ru, sk, sq, th, ur, zh_cn, zh_tw

source: Install
ar: ثبت
ast: Instalar
bg: Инсталиране
ca: Instal·la
cs: Nainstalovat
de: Installation
fi: Asenna
gl: Instalar
he: התקנה
hr: Instaliraj
hu: Telepítés
id: Pasang
it: Installa
lt: Įdiegti
ms: Pasang
nb: Installasjon
nl: Installeren
pl: Zainstaluj
pt: Instalar
ru: Установить
sk: Inštalovať
sq: Instalo
th: ติดตั้ง
ur: نصب کریں
zh_cn: 安装
zh_tw: 安裝

source: Installation drive:
ar: سواقة التثبيت:
ast: Preséu d'instalación:
bg: Устройства за инсталиране:
ca: Unitat d'instal·lació
cs: Jednotka pro instalaci:
de: Installationslaufwerk:
fi: Asennuslevy:
gl: Unidade da instalación:
he: כונן ההתקנה:
hr: Instalacijski pogon:
hu: Telepítés helye:
id: Drive instalasi
it: Disco di installazione:
lt: Diegimo diskas:
ms: Pemacu pemasangan:
nb: Installasjonsdisk:
nl: Installatieschijf:
pl: Wolumen instalacji:
pt: Drive de instalação:
ru: Диск установки:
sk: Inštalačná jednotka:
sq: Disku i instalimit:
th: ติดตั้งที่ไดรว์:
ur: انسٹالیشن ڈرائیو:
zh_cn: 目标驱动器：
zh_tw: 安裝磁碟：

source: Installation size:
ar: حجم التثبيت:
ast: Tamañu d'instalación:
bg: Инсталационен размер:
ca: Mida de la instal·lació:
cs: Velikost instalace:
de: Installationsgröße:
fi: Asennuksen koko:
gl: Tamaño da instalación:
he: גודל ההתקנה:
hr: Veličina instalacije:
hu: Telepítés mérete:
id: Ukuran instalasi
it: Dimensione dell'installazione:
lt: Diegimo dydis:
ms: Saiz pemasangan:
nb: Installasjonsstørrelse:
nl: Installatiegrootte:
pl: Rozmiar instalacji:
pt: Tamanho da Instalação
ru: Размер установки:
sk: Veľkosť inštalácie:
sq: Përmasa e instalimit:
th: ขนาดติดตั้ง:
ur: انسٹالیشن سائیز:
zh_cn: 安装大小：
zh_tw: 安裝大小：

source: Desktop environment:
ar: بيئة سطح المكتب:
ast: Entornu d'escritoriu:
bg: Графична среда:
ca: Entorn d'escriptori:
cs: Pracovní prostředí:
de: Desktopumgebung:
fi: Työpöytäympäristö:
gl: Contorno de escritorio:
he: סביבת שולחן העבודה:
hr: Radno okružje:
hu: Asztali környezet:
id: Lingkungan desktop:
it: Ambiente grafico:
lt: Darbalaukio aplinka:
ms: Persekitaran Desktop
nb: Skrivebordsmiljø
nl: Bureaubladomgeving:
pl: Środowisko graficzne:
pt: Ambiente de trabalho
ru: Окружение рабочего стола:
sk: Pracovné prostredie:
sq: Ambienti i desktopit
th: สภาพแวดล้อมพื้นโต๊ะ:
ur: ڈیسکٹاپ انوائرمینٹ:
zh_cn: 桌面环境：
zh_tw: 桌面環境：

source: Language:
ar: اللغة:
ast: Llingua:
bg: Език:
ca: Idioma:
cs: Jazyk:
de: Sprache:
fi: Kieli:
gl: Idioma:
he: שפה:
hr: Jezik:
hu: Nyelv:
id: Bahasa:
it: Lingua:
lt: Kalba:
ms: Bahasa:
nb: Språk:
nl: Taal:
pl: Język:
pt: Idioma:
ru: Язык:
sk: Jazyk:
sq: Gjuha:
th: ภาษา:
ur: زبان:
zh_cn: 语言：
zh_tw: 語言：

source: Username:
ar: اسم المستخدم:
ast: Nome d'usuariu:
bg: Потребителско име:
ca: Nom d'usuari:
cs: Uživatelské jméno:
de: Benutzername:
fi: Käyttäjänimi:
gl: Nome de usuario:
he: שם משתמש:
hr: Korisničko ime:
hu: Felhasználónév:
id: Nama pengguna:
it: Nome utente:
lt: Naudotojo vardas:
ms: Nama pengguna:
nb: Brukernavn:
nl: Gebruikersnaam:
pl: Nazwa użytkownika:
pt: Nome de utilizador:
ru: Имя пользователя:
sk: Používateľské meno:
sq: Emri i Përdoruesit:
th: ชื่อผู้ใช้:
ur: اسم صارف:
zh_cn: 用户名：
zh_tw: 使用者名稱：

source: Password:
ar: كلمة السر:
ast: Contraseña:
bg: Парола:
ca: Contrasenya:
cs: Heslo:
de: Passwort:
fi: Salasana:
gl: Contrasinal:
he: סיסמה:
hr: Lozinka:
hu: Jelszó:
id: Kata sandi:
lt: Slaptažodis:
ms: Kata laluan:
nb: Passord:
nl: Wachtwoord:
pl: Hasło:
pt: Senha:
ru: Пароль:
sk: Heslo:
sq: Fjalëkalimi:
th: รหัสผ่าน:
ur: کلمہ‌ شناخت:
zh_cn: 口令：
zh_tw: 密碼：

source: %s Installer
ar: مثبت %s
ast: Instalador %s
bg: Инсталатор на %s
ca: Instal·lador %s
cs: Instalátor %s
de: %s-Installationsprogramm
fi: %s - asennus
gl: %s Instalador
he: תכנית התקנת %s
hr: %s instalacijski program
hu: %s telepítő
id: Penginstal %s
it: Programma di installazione di %s
lt: %s diegimo programa
ms: %s Pemasangan
nl: Installatie van %s
pl: Instalator %s
pt: Instalador %s
ru: Установщик %s
sk: %s Inštalátor
sq: Instaluesi i %s
th: ตัวติดตั้ง %s
ur: %s انسٹالر
zh_cn: %s 安装程序
zh_tw: %s 安裝程式

source: You are about to install %(distro)s-%(version)s
ar: أنت على وشك تثبيت %(distro)s-%(version)s
ast: Tas a piques d'instalar %(distro)s-%(version)s
bg: Ще инсталирате %(distro)s-%(version)s
ca: Esteu a punt d'instal·lar %(distro)s-%(version)s
cs: Chystáte se nainstalovat %(distro)s-%(version)s
de: Sie sind im Begriff, %(distro)s-%(version)s zu installieren
fi: Asennetaan %(distro)s-%(version)s
gl: Esta a piques de instalar %(distro)s-%(version)s
he: %(distro)s-%(version)s מועמדת להתקנה
hr: Upravo ćete instalirati %(distro)s-%(version)s
hu: A(z) %(distro)s-%(version)s telepítésére készül
id: Anda akan memasang %(distro)s-%(version)s
it: Si sta per installare %(distro)s-%(version)s
lt: Jūs tuoj įdiegsite %(distro)s-%(version)s
ms: Anda akan memasang %(distro)s-%(version)s
nb: Du er i ferd med å innstallere %(distro)s-%(version)s
nl: U staat op het punt om %(distro)s-%(version)s te installeren
pl: Instalowanie %(distro)s-%(version)s
pt: Está prestes a instalar a %(distro)s-%(version)s
ru: Вы собираетесь установить %(distro)s-%(version)s
sk: Práve idete nainštalovať %(distro)s-%(version)s
sq: Po bëheni gati të instaloni %(distro)s-%(version)s
th: คุณมีความต้องการติดตั้ง %(distro)s-%(version)s
ur: آپ %(distro)s-%(version)s انسٹال کرنے جا رہے ہیں
zh_cn: 您正要安装 %(distro)s %(version)s
zh_tw: 您正要安裝 %(distro)s-%(version)s

source: %(min_memory)sMB of memory are required for installation. Only %(total_memory)sMB are available. The installation may fail in such circumstances. Do you wish to continue anyway?
ar: مطلوب %(min_memory)sم.بايت من الذاكرة لعملية التثبيت. %(total_memory)sم.بايت متوفرة فقط. في مثل هذه الحالة قد تفشل عملية التثبيت. هل ترغب في المتابعة بالرغم من ذلك؟
ast: Necesitense %(min_memory)sMB de memoria pa siguir. Sólo hai disponibles %(total_memory)sMB. La instalación seique falle nestes circunstancies. ¿Quies continuar de toles maneres?
bg: %(min_memory)sМБ памет е нужна за инсталация. Само %(total_memory)sМБ е налична. Инсталацията може да е неуспешна. Искате ли да продължите въпреки това?
ca: Calen %(min_memory)s MB de memòria per a la instal·lació. Només hi ha %(total_memory)s MB disponibles. Pot ser que en aquestes circumstàncies falli la instal·lació. Voleu continuar de totes maneres?
cs: %(min_memory)sMB paměti je vyžadováno pro instalaci. Pouze %(total_memory)sMB je dostupných. Instalace může za určitých okolností selhat. Přejete si přesto pokračovat v instalaci?
de: %(min_memory)sMB an Speicherplatz werden für die Installation benötigt. Es sind nur %(total_memory)sMB verfügbar. Die Installation kann unter solchen Umständen scheitern. Wollen Sie trotzdem fortfahren?
fi: %(min_memory)sMB muista vaaditaan asennukseen. Vain %(total_memory)sMB on saatavilla. Asennus voi epäonnistua. Haluatko kuitenkin jatkaa?
gl: Requírese %(min_memory)sMB de memoria para a instalación. Só está dispoñíbel %(total_memory)sMB de memoria. A instalación pode fallar en tales circunstancias. Quere continuar de todas maneiras?
he: %(min_memory)sמ"ב של זיכרון נחוצים להתקנה. רק %(total_memory)sמ"ב זמינים. בנסיבות אלו ההתקנה עלולה להיכשל. האם ברצונך להמשיך בכל מקרה?
hr: Potrebno je %(min_memory)sMB memorije za instalaciju. Raspoloživo je samo %(total_memory)sMB. U ovakvom slučaju moguće je da instalacije ne uspije. Želite li ipak nastaviti?
hu: %(min_memory)s MB memória szükséges a telepítéshez. Csak %(total_memory)s MB érhető el. A telepítés ilyen körülmények között meghiúsulhat. Mindenképp folytatja?
id: Dibutuhkan memori %(min_memory)sMB untuk instalasi. Hanya %(total_memory)sMB yang tersedia. Instalasi mungkin gagal bila keadaannya seperti ini. Apakah Anda ingin tetap melanjutkan?
it: Sono richiesti %(min_memory)s MiB di memoria per l'installazione. Solo %(total_memory)s MiB sono disponibili. L'installazione potrebbe non riuscire in tali circostanze. Continuare lo stesso?
lt: Diegimui reikia %(min_memory)s MB atminties. Yra prieinama tik %(total_memory)s MB. Esant tokiai situacijai diegimas gali būti nesėkmingas. Ar vistiek norite tęsti?
ms: %(min_memory)sMB daripada cakera keras anda diperlukan untuk pemasangan. Hanya %(total_memory)sMB yang tinggal. Pemasang akan gagal dalam keadaan tersebut. Adakah anda ingin teruskan?
nb: %(min_memory)sMB minne er påkrevd for installasjonen. Barey %(total_memory)sMB er tilgjengelig. Innstallasjonen kan feile i slike tilfeller. Vil du fortsette uansett?
nl: %(min_memory)sMB is benodigd voor de installatie. Er is maar %(total_memory)sMB beschikbaar. De installatie kan onder deze omstandigheden mislukken. Wilt u de installatie toch voortzetten?
pl: Wymagane jest %(min_memory)s MB wolnej przestrzeni pamięci operacyjnej. Dostępne jest tylko %(total_memory)s MB. Instalacja może się nie udać. Kontynuować?
pt: %(min_memory)sMB de memória são necessários para a instalação. Apenas %(total_memory)sMB estão disponíveis. A instalação poderá falhar nestas circunstâncias. Deseja continuar mesmo assim?
ru: Для установки требуется %(min_memory)sМБ дискового пространства. Доступно только %(total_memory)sМБ. Продолжение может привести к аварийному завершению установки. Вы уверены, что ходите продолжить?
sk: %(min_memory)s MB pamäte je potrebných na inštaláciu. Voľných je len %(total_memory)s MB. Za týchto okolností môže inštalácia zlyhať . Želáte si napriek tomu pokračovať?
th: ต้องการหน่วยความจำ %(min_memory)sMB เพื่อการติดตั้ง มีเพียง %(total_memory)sMB ที่ใช้ได้ การติดตั้งอาจล้มเหลวภายใต้สภาวะเช่นนี้ คุณต้องการดำเนินการต่อไปหรือไม่?
ur: تنصیب کے لیے %(min_memory)s ایم بی میموری کی ضرورت ہے۔ صرف %(total_memory)s ایم بی دستیاب ہیں۔ تنصیب ایسے حالات میں ناکام ہو سکتی ہے۔ کیا آپ ہر صورت جاری رکھنا چاہتے ہیں؟
zh_cn: 安装需要 %(min_memory)sM 内存。 现在可用内存只有 %(total_memory)sM。 当前安装方式下，安装可能失败。 仍然要继续吗？
zh_tw: 需要 %(min_memory)sMB 的記憶體以安裝。 只有 %(total_memory)sMB 可用。 在這樣的情況下很可能安裝失敗。 無論如何您都想要繼續嗎？

source: Please enter a valid username
ar: أدخل اسم مستخدم صالح من فضلك
ast: Por favor, introduza un nome d'usuariu válidu.
bg: Моля въведете валидно потребителско име
ca: Introduïu un nom d'usuari vàlid
cs: Vložte prosím správné uživatelské jméno
de: Bitte geben Sie einen gültigen Benutzernamen ein
fi: Syötä kelvollinen käyttäjänimi
gl: Por favor, introduza un nome de usuario válido
he: נא להזין שם משתמש תקני
hr: Molim unesite valjano korisničko ime
hu: Adjon meg egy érvényes felhasználónevet
id: Masukkan nama pengguna yang benar
it: Inserire un nome utente valido
lt: Įveskite teisingą naudotojo vardą
ms: Sila masukkan nama pengguna yang sah
nb: Vennligst skriv et godkjent brukernavn
nl: Voer een geldige gebruikersnaam in
pl: Proszę wprowadzić prawidłową nazwę użytkownika
pt: Por favor introduza um nome de utilizador válido
ru: Пожалуйста, введите допустимое имя пользователя
sk: Prosím, zadajte platné používateľské meno
sq: Ju lutemi vendosni një emër përdoruesi të vlefshëm
th: โปรดป้อนชื่อผู้ใช้ที่ถูกต้อง
ur: براہ مہربانی درست اسم صارف درج کریں
zh_cn: 请输入有效的用户名称
zh_tw: 請輸入正確的使用者名稱

source: Please use all lower cases in the username.
ar: يرجى استخدام الأحرف الصغيرة (الإنجليزية) في اسم المستخدم.
ast: Por favor, use namái minúscules nel nome d'usuariu.
bg: Моля, използвайте само малки букви в потребителското име.
ca: Utilitzeu nomeś minúscules en el nom d'usuari.
cs: V uživatelském jméně používejte prosím všechna písmena malá.
de: Bitte verwenden Sie ausschließlich Kleinbuchstaben im Benutzernamen.
fi: Käytä vain pieniä kirjaimia käyttäjänimessä.
gl: Por favor, use minúsculas no nome de usuario.
he: יש להשתמש באותיות קטנות בלבד בשם המשתמש.
hr: Molim koristite samo mala slova u korisničkom imenu.
hu: Csak kisbetűket használjon a felhasználónévben.
id: Gunakan hanya huruf kecil untuk nama pengguna.
it: Utilizzare solo caratteri minuscoli nel nome utente.
lt: Naudotojo vardą rašykite tik mažosiomis raidėmis.
ms: Sila gunakan huruf kecil pada nama pengguna.
nb: Vennligst bruk kun små bokstaver i brukernavnet.
nl: Gebruik geen hoofdletters voor de gebruikersnaam.
pl: Proszę używać tylko małych liter w nazwie użytkownika.
pt: Por favor utilize apenas letras minúsculas no nome de utilizador
ru: Пожалуйста, используйте в имени пользователя только строчные буквы.
sk: Prosím, napíšte používateľské meno malými písmenami.
sq: Ju lutem përdorni vetëm shkronja të vogla në emrin e përdoruesit.
th: โปรดใช้ตัวพิมพ์เล็กในชื่อผู้ใช้
ur: مہربانی فرما کر صارف کے نام میں صرف چھوٹے حروف استعمال کریں۔
zh_cn: 请完全使用小写字母设置用户名称。
zh_tw: 使用者名稱必須全為小寫

source: Please do not use spaces in the username.
ar: يرجى عدم استخدام المسافات في اسم المستخدم.
ast: Por favor, nun use espacios nel nome d'usuariu.
bg: Моля, не използвайте интервали в потребителското име.
ca: No utilitzeu espais al nom d'usuari.
cs: Nepoužívejte prosím mezery v uživatelském jméně.
de: Bitte verwenden Sie keine Leerzeichen im Benutzernamen.
fi: Älä käytä välilyöntejä käyttäjänimessä.
gl: Por favor, non use espazos en branco no nome de usuario.
he: נא לא להשתמש ברווחים כחלק משם מהמשתמש.
hr: Molim ne koristite razmake u korisničkom imenu.
hu: Ne használjon szóközt a felhasználónévben.
id: Jangan menggunakan spasi untuk nama pengguna.
it: Non usare spazi nel nome utente.
lt: Naudotojo varde nenaudokite tarpų.
ms: Jangan tinggalkan ruang dalam nama pengguna.
nb: Vennligst ikke bruk mellomrom i brukernavnet.
nl: Gebruik geen spaties voor de gebruikersnaam.
pl: Proszę nie używać spacji w nazwie użytkownika.
pt: Por favor não utilize espaços no nome de utilizador.
ru: Пожалуйста, не используйте пробелы в имени пользователя.
sk: Prosím, nepoužívajte medzery v používateľskom mene.
sq: Ju lutem mos përdorni hapësira në emrin e përdoruesit.
th: โปรดอย่าใช้เว้นวรรคในชื่อผู้ใช้
ur: برائے مہربانی صارف کے نام میں خالی جگہ مت استعمال کریں۔
zh_cn: 请勿在用户名称中使用空格。
zh_tw: 使用者名稱不可包含空白字元

source: Your username must start with a letter.
ast: El so nome d'usuariu tien d'entamar con una lletra.
bg: Вашето име трябва да започва с буква.
fi: Käyttäjänimen tulee alkaa kirjaimella.
he: על שם המשתמש להתחיל באות.
hr: Vaše korisničko ime mora započeti sa slovom.
it: Il proprio nome utente deve iniziare con una lettera.
lt: Naudotojo vardas turi prasidėti raide.
nb: Ditt brukernavn må starte med en bokstav.
pt: O nome de utilizador tem que começar com uma letra.
sk: Vaše používateľské meno musí začínať písmenom.
th: ชื่อผู้ใช้คุณต้องเริ่มต้นด้วยตัวอักษร

source: Your username must contain only standard letters and numbers.
ast: El so nome d'usuariu tien de contener namái lletres y númberos estándar.
bg: Вашето потребителско име трябва да съдържа само латински букви и цифри.
fi: Käyttäjänimessä tulee olla vain tavallisia kirjaimia ja numeroita.
he: על שם המשתמש שלך להכיל אותיות באנגלית ומספרים תקניים בלבד.
hr: Vaše korisničko ime mora sadržavati uobičajena slova i brojke.
it: Il proprio nome utente deve contenere solo lettere standard e numeri.
lt: Naudotojo vardas turi būti sudarytas tik iš standartinių raidžių ir skaičių.
nb: Ditt brukernavn kan bare inneholde vanlige bokstaver og nummer.
pt: O nome de utilizador apenas pode conter letras comuns e números.
sk: Vaše používateľské meno musí obsahovať len štandardné písmená a číslice.
th: ชื่อผู้ใช้ของคุณต้องประกอบไปด้วยตัวอักขระมาตรฐานและตัวเลขเท่านั้น

source: The selected username is reserved, please select a different one.
ar: اسم المستخدم الذي اخترته محجوز، من فضلك اختر اسماً آخر.
ast: El nome d'usuariu escoyíu ta acutáu; por favor, escueye otru diferente.
bg: Избраното потребителско име е резервирано, моля изберете друго.
ca: El nom d'usuari seleccionat està reservat, per la qual cosa n'hauríeu de seleccionar un altre.
cs: Vybrané uživatelské jméno je vyhrazené, zvolte prosím jiné.
de: Der gewählte Benutzername ist schon vergeben, bitte wählen Sie einen anderen.
fi: Valittu käyttäjänimi on varattu, käytä toista käyttäjänimeä.
gl: O nome de usuario seleccionado está reservado, seleccione outro diferente.
he: שם המשתמש הנבחר הינו שמור, יש לבחור בשם אחר.
hr: Odabrano korisničko ime je rezervirano, molim odaberite drugo.
hu: A választott felhasználónevet a rendszer fenntartja, kérem válasszon egy másikat.
id: Nama pengguna teah digunakan, silakan pilih nama lain.
it: Il nome utente inserito è riservato, selezionarne un altro.
lt: Pasirinktas naudotojo vardas yra rezervuotas, pasirinkite kitą.
ms: Nama pengguna yang dipilih telah direzabkan, sila pilih yang lain.
nb: Det valgte brukernavnet er reservert. Vennligst velg et annet.
nl: De opgegeven gebruikersnaam is gereserveerd, kies een andere.
pl: Zaznaczona nazwa użytkownika jest zajęta, proszę wybrać inną.
pt: O nome de utilizador selecionado está reservado, por favor escolha um diferente.
ru: Выбранное имя пользователя зарезервировано в системе, пожалуйста, выберите другое.
sk: Vybrané používateľské meno je rezervované, prosím, vyberte si iné.
sq: Emri i zgjedhur i përdoruesit është i rezervuar, ju lutemi të zgjidhni një tjetër.
th: ชื่อผู้ใช้ที่เลือกได้ถูกสงวนไว้ โปรดเลือกชื่ออื่น
ur: منتخب شدہ صارف نام مخصوص ہے، برائے مہربانی متخلف منتخب کریں۔
zh_cn: 选择的用户名已保留为其它用途，请指定其他用户名。
zh_tw: 所選的使用者名稱已反轉，請選取不同的名稱。

source: Please enter a valid password.
ar: يرجى إدخال كلمة سر سليمة.
ast: Por favor, introduza una contraseña válida.
bg: Моля, въведете валидна парола.
ca: Introduïu una contrasenya vàlida.
cs: Vložte prosím platné heslo.
de: Bitte geben Sie ein gültiges Passwort ein.
fi: Syötä kelvollinen salasana.
gl: Por favor, introduza un contrasinal válido.
he: נא להזין סיסמה תקנית.
hr: Molim unesite valjanu lozinku.
hu: Írjon be egy érvényes jelszót.
id: Masukkan kata sandi yang benar.
it: Inserire una password valida.
lt: Įveskite teisingą slaptažodį.
ms: Sila masukkan kata laluan yang sah.
nb: Vennligst skriv et godkjent passord.
nl: Voer een geldige gebruikersnaam in.
pl: Proszę wprowadzić poprawne hasło.
pt: Por favor introduza uma palavra passe válida.
ru: Пожалуйста, введите подходящий пароль.
sk: Prosím, vložte správne heslo.
sq: Ju lutem shkruani një fjalëkalim të vlefshëm
th: โปรดใส่รหัสผ่านที่ถูกต้อง
ur: برائے مہربانی درست پاس ورڈ درج کریں۔
zh_cn: 请输入有效密码。
zh_tw: 請輸入符合規範的密碼

source: Please do not use spaces in the password.
ar: يرجى عدم استخدام المسافات في كلمة السر.
ast: Por favor, nun use espacios na contraseña.
bg: Моля, не използвайте интервали в паролата.
ca: No utilitzeu espais a la contrasenya.
cs: Nepoužívejte prosím mezery v hesle.
de: Bitte verwenden Sie keine Leerzeichen im Passwort.
fi: Salasanassa ei tule käyttää välilyöntejä.
gl: Por favor, non use espazos no contrasinal.
he: נא לא להשתמש ברווחים בסיסמה.
hr: Molim nemojte koristiti razmake u lozinci.
hu: Ne használjon szóközt a jelszóban.
id: Jangan menggunakan spasi dalam kata sandi.
it: Non usare spazi nella password.
lt: Slaptažodyje nenaudokite tarpų.
ms: Jangan tinggalkan ruang dalam kata laluan.
nb: Vennligst ikke bruk mellomrom i passordet.
nl: Gebruik geen spaties in het wachtwoord.
pl: Proszę nie używać spacji w haśle.
pt: Por favor não utilize espaços na palavra passe.
ru: Пожалуйста, не используйте пробелы в пароле.
sk: Prosím, nepoužívajte medzery v hesle.
sq: Ju lutem mos përdorni hapësira në fjalëkalim.
th: โปรดอย่าใช้เว้นวรรคในรหัสผ่าน
ur: برائے مہربانی پاس ورڈ میں خالی جگہ مت استعمال کریں۔
zh_cn: 请勿在密码中使用空格。
zh_tw: 密碼不可包含空白字元

source: Passwords do not match.
ar: كلمتا السر لا تتطابقان.
ast: Les contraseñes nun concasen.
bg: Паролите не съвпадат.
ca: Les contrasenyes no coincideixen.
cs: Hesla si neodpovídají.
de: Die Passwörter stimmen nicht überein.
fi: Salasanat eivät täsmää.
gl: Os contrasinais non coinciden.
he: הסיסמאות אינן תואמות.
hr: Lozinke se ne podudaraju.
hu: A jelszavak nem egyeznek.
id: Kata sandi tidak sama.
it: Le password non coincidono.
lt: Slaptažodžiai nesutampa.
ms: Kata laluan tidak sepadan.
nb: Passordene stemmer ikke overens.
nl: Wachtwoorden komen niet overeen.
pl: Wprowadzone hasła sie są takie same.
pt: A palavra passe não coincide.
ru: Пароли не совпадают.
sk: Heslá sa nezhodujú.
sq: Fjalëkalimet nuk përputhen.
th: รหัสผ่านไม่ตรงกัน
ur: خفیہ لفظ میل نہیں کھاتا۔
zh_cn: 密码不一致。
zh_tw: 新密碼並不相符。

source: Please wait
ar: انتظر رجاء
ast: Por favor aguarda
bg: Моля изчакайте
ca: Espereu un moment
cs: Prosím čekejte
de: Bitte warten
fi: Odota
gl: Espere
he: נא להמתין
hr: Molim pričekajte
hu: Kis türelmet
id: Silakan tunggu
it: Attendere
lt: Prašome palaukti
ms: Sila tunggu
nb: Vennligst vent
nl: Een moment geduld
pl: Proszę czekać
pt: Por favor aguarde...
ru: Пожалуйста, подождите
sk: Čakajte, prosím
sq: Ju lutem prisni
th: กรุณารอสักครู่
ur: برائےمہربانی انتظار کریں
zh_cn: 请稍候
zh_tw: 請稍候

source: Do not download, use a local file
ar: لا تنزّل، استخدم ملفاً محلياً.
ast: Nun descargar; usar un ficheru llocal
bg: Без изтегляне, използване на локален файл
ca: No facis cap baixada, utilitza un fitxer local
cs: Nestahovat, použít místní soubor
de: Es wird nichts heruntergeladen, sondern eine lokale Datei benutzt
fi: Älä nouda, käytä paikallista tiedostoa
gl: Non descargar, usar un ficheiro local
he: ללא הורדה, שימוש בקובץ מקומי
hr: Ne preuzimaj, koristi lokalnu datoteku
hu: Ne töltse le, használjon helyi fájlt
id: Jangan unduh, gunakan berkas lokal
it: Non scaricare, usa un file locale
lt: Nesiųsti, naudoti vietinį failą
ms: Jangan muat turun, guna fail lokal
nb: Last ikke ned, bruk en lokal fil
nl: Niet downloaden, een lokaal bestand gebruiken
pl: Użycie lokalnego pliku
pt: Não transferir. Utilizar um ficheiro local
ru: Не загружать, использовать локальный файл
sk: Nesťahovať, použiť lokálny súbor
sq: Mos e shkarko, përdor një skedar lokal
th: ไม่ดาวน์โหลด ใช้แฟ้มในเครื่อง
ur: ڈاؤن لوڈ مت کریں، مقامی فائل کا استعمال کریں
zh_cn: 不进行下载，使用本地文件
zh_tw: 不要下載，使用本地檔案

source: Remaining time approximately %s
bg: Приблизително оставащо време %s
ca: Temps restant aproximat %s
cs: Přibližný zbývající čas %s
de: Verbleibende Zeit ungefähr %s
fi: Jäljellä oleva aika noin %s
gl: Tempo restante aproximado %s
he: הזמן הנותר המשוערך %s
hr: Preostalo je otprilike %s
hu: Hátralévő idő körülbelül %s
it: Tempo rimanente: %s
lt: Apytiksliai liko %s
ms: Jangkaan masa yang tinggal %s
nl: Resterende tijd ongeveer %s
pl: Pozostały czas:
pt: Tempo restante é de %s aproximadamente
ru: Осталось примерно %s
sk: Zostávajúci čas je približne %s
th: เหลือเวลาอีกประมาณ %s
ur: باقی وقت تقریبا %s
zh_cn: 剩余时间约为 %s
zh_tw: 剩餘時間大約為 %s

source: Completing the %s Setup Wizard
ar: يكمل مرشد تثبيت %s
ast: Completando l'Asistente de Configuración %s
bg: Завършване на съветника на %s
ca: S'està completant l'auxiliar de configuració %s
cs: Dokončování průvodce instalací %s
de: %s Installationsassistent wird fertiggestellt
fi: %s - viimeistellään opastettua asennusta
gl: Completando o %s Asistente de instalación
he: השלמת אשף ההתקנה של %s מתבצעת כעת
hr: Dovršavanje %s čarobnjaka postavki
hu: A(z) %s telepítővarázsló befejezése
id: Menyelesaikan% s Setup Wizard
it: Completamento assitente configurazione di %s
lt: Baigiama %s diegimo programa
ms: Menyelesaikan Pendeta Pemasangan %s
nb: Kompletterer %s oppstartsveiviser
nl: Installatie van %s voltooien
pl: Kończenie pracy instalatora %s
pt: A finalizar o Assistente de Configuração %s
ru: Завершение работы Помощника установки %s
sk: Dokončuje sa %s inštalačný sprievodca
sq: Duke kompletuar instalimin e %s
th: ตัวช่วยติดตั้ง %s เสร็จสมบูรณ์
ur: سیٹ اپ وزرڈ مکمل %s
zh_cn: 完成 %s 安装向导
zh_tw: 正在完成 %s 設定魔法師
