Repository: hakuna-m/wubiuefi
Catalog: po/*.po
Languages: ar, ast, bg, ca, cs, de, fi, gl, he, hr, hu, id, it, lt, ms, nb, nl, pl, pt, ru, sk, sq, th, ur, zh_cn, zh_tw

source: If your machine cannot boot off the CD, this program will install a new boot menu entry to help you boot from CD. In most cases this program is not needed, and it is sufficient to reboot with the CD-Rom in the tray. Do you want to proceed and install the CD booter?
ar: إذا كان حاسوبك غير قادر على الإقلاع من القرص المدمج، فإن هذا البرنامج سوف يثبت مدخلة جديدة في قائمة الإقلاع لمساعدتك على الإقلاع من القرص المدمج. في معظم الحالات، لن تحتاج لهذا البرنامج، وسيكون كافيًا أن تعيد التشغيل مع وجود القرص المدمج داخل قارئ الأقراص. هل تود المواصلة وتثبيت مُقْلِع القرص المدمج؟
ast: Si'l so equipu nun pue arrancar dende'l CD, esti programa instalará una nueva entrada nel menú d'arranque p'aidalu a arrancar dende'l CD. Na mayoría de los casos esti programa nun fai falta, y basta con reaniciar l'equipu col CD-ROM dintro de la unidá. ¿Quier continuar ya instalar el cargador del CD?
bg: Ако компютърът ви не може да зареди директно от CD диска, тази програма ще инсталира ново меню, което ще ви помегне да заредите директно от CD диска. В повечето случаи тази програма не е необходима и е достатъчно само да рестартирате компютъра, докато дискът е в CD-ROM/DVD устройството. Желаете ли да продължите и да инсталирате програмата за зареждане от инсталационния диск?
ca: Si el vostre ordinador no pot arrencar des del CD, aquest programa instal·larà una nova opció al menu perquè ho pogueu fer. En la majoria de casos no caldrà, i serà suficient el tornar a engegar l'ordinador amb el CD dins del lector. Voleu continuar i instal·lar l'arrencador de CD?
cs: Pokud váš počítač nedokáže startovat z CD, tento program nainstaluje novou položku v nabídce zavaděče, aby vám pomohl zavést systém z CD. Ve většině případů není tento program nutný a stačí restartovat s CD v mechanice. Chcete pokračovat a nainstalovat zavaděč CD?
de: Falls Ihr Rechner nicht von der CD starten kann, wird dieses Programm einen neuen Eintrag im Bootmenü erstellen, um das Starten von CD zu ermöglichen. In den meisten Fällen ist dies nicht notwendig und es reicht aus, den Rechner mit der CD im Laufwerk neu zu starten. Möchten Sie fortfahren und den CD-Booter installieren?
fi: Jos tietokoneesi ei osaa käynnistyä CD-levyltä, tämä ohjelma asentaa uuden käynnistysvalikkovalinnan, joka auttaa tietokoneen käynnistämisessä CD-levyltä. Useimmissa tapauksissa tätä ohjelmaa ei tarvita, riittää että tietokone käynnistetään uudelleen CD-levyn ollessa CD-asemassa. Haluatko jatkaa ja asentaa CD-levyn lataimen?
gl: Se a máquina non pode arrancar dende o CD, este programa instalará unha nova entrada no menú de inicio para axudalo a que arranque dende o CD. Na maior parte dos casos este programa non é preciso, e resulta suficiente arrancar co CD-Rom na bandexa. Quere proceder e instalar o arranque dende o CD?
he: אם המחשב שלך לא מצליח להעלות את נתוני האתחול מהתקליטור, תכנה זו תוסיף רשומה חדשה בתפריט האתחול שתסייע לך לאתחל מהתקליטור. ברב המקרים תכנה זו אינה נחוצה, ואתחול כשהתקליטור נמצא בכונן מספק בהחלט. האם ברצונך להמשיך ולהתקין את המאתחל מתקליטורים?
hr: Ako vaše računalo ne može učitati sustav s CD-a, ovaj program će dodati novu stavku boot izbornika s ciljem da vam pomogne učitati sustav s CD-a. U većini slučajeva, ovaj program nije potreban, te je dovoljno ponovno pokrenuti računalo s CD-om u računalu. Želiteli instalirati učitavača s CD-a?
hu: Ha a gépe nem képes CD-ről indulni, akkor ez a program telepít egy új indítómenü-bejegyzést a CD-ről történő indulás elősegítése érdekében. A legtöbb esetben erre a programra nincs szükség, és elegendő az újraindítás a meghajtóba helyezett CD-vel Kívánja folytatni a telepítő CD-indító telepítésével?
id: Apabila mesin Anda tak bisa boot dari CD, program ini akan memasang entri menu boot baru untuk membantu Anda boot dari CD. Dalam kebanyakan kasus program ini tidak diperlukan, dan cukup untuk boot ulang dengan CD-Rom. Apakah Anda ingin meneruskan dan memasang perangkat boot dari CD?
it: Se il computer non può essere avviato da CD, questo programma aggiungerà una nuova opzione al menu di avvio che permetterà di eseguire l'avvio da CD. Nella maggior parte dei casi non è necessario usare tale programma ed è sufficiente riavviare il computer con il CD inserito. Procedere e installare il programma di avvio da CD?
lt: Jei jūsų kompiuteris negali įsikrauti iš kompaktinio disko, ši programa įdiegs naują įkrovos meniu įrašą, įkrausiantį kompiuterį iš kompaktinio disko. Dažniausiai tai nėra reikalinga, pakanka perkrauti kompiuterį neišėmus kompaktinio disko. Ar norite tęsti ir įdiegti įkrovos iš kompaktinio disko paleidyklę?
ms: Jika komputer anda tidak dapat boot dari CD, program ini akan memasang menu boot yang membantu anda boot dari CD. Dalam kebanyakan kes, program ini tidak diperlukan dan dapat boot dengan CD dalam pemacu CD-ROM. Adakah anda mahu teruskan memasang CD booter?
nb: Hvis din maskin ikke kan laste fra CD vil dette programmet installere en ny oppstartsmenyoppføring for å hjelpe deg å laste fra CD. I de fleste tilfeller trengs ikke dette programmet, og det er tilstrekkelig og starte på nytt med CD-en i skuffen. Vil du forsette og installere CD-oppstarteren?
nl: Als uw computer niet van de cd kan opstarten, zal dit programma een optie in het opstartmenu toevoegen om u te helpen bij het opstarten vanaf de cd. In de meeste gevallen is dit programma niet nodig en is het voldoende om te herstarten met de cd-rom in de cd-lade. Wilt u doorgaan en de cd-opstarter installeren?
pl: Jeśli komputer nie może zostać uruchomiony z płyty CD, ten program doda nowy wpis do menu rozruchu, aby uruchomić system z płyty. W większości przypadków ten program nie jest potrzebny i wystarczające jest uruchomienie komputera z płytą CD w napędzie. Kontynuować i zainstalować uruchamianie z CD?
pt: Se a sua máquina não pode arrancar a partir do CD este programa irá instalar uma nova entrada no menu de arranque para o ajudar a arrancar a partir do CD. Na maior parte dos casos este programa não é necessário e é suficiente reiniciar com o CD-Rom dentro da unidade.
ru: Если ваш компьютер не может загружаться с компакт диска, данная программа добавит новый пункт в загрузочное меню, чтобы помочь вам загрузиться с компакт диска. В большинстве случаев эта программа не нужна и достаточно просто перезагрузить компьютер, оставив диск в приводе. Установить загрузчик с CD?
sk: Ak váš počítač nedokáže štartovať z CD, tento program nainštaluje novú položku v ponuke zavádzača, aby vám pomohol zaviesť systém z CD. Vo väčšine prípadov je tento program nepotrebný a stačí reštartovať s CD v mechanike. Chcete pokračovať a nainštalovať zavádzač CD?
th: หากเครื่องของคุณไม่สามารถบูตผ่านซีดี โปรแกรมนี้จะติดตั้งเมนูใหม่เพื่อช่วยคุณบูตจากซีดี กรณีส่วนใหญ่แล้วโปรแกรมนี้ไม่มีความจำเป็น และมันเพียงพอแล้วที่จะเริ่มใหม่ด้วยซีดีรอมที่อยู่ในถาด คุณต้องการดำเนินการและติดตั้งตัวบูตซีดี?
ur: اگر آپ کی مشین سی ڈی سے بوٹ نہیں کر سکتی تو یہ پروگرام ایک نئی بوٹ انٹری نصب کر دے گا جو سی ڈی سے بوٹ کرنے میں مدد دے گی۔ اکثر صورتوں میں اس پروگرام کی ضرورت نہیں ہوتی، اور صرف یہی کافی ہوتا ہے کہ سی ڈی روم کو ٹرے میں رکھ کر دوبارہ چلایا جائے۔ کیا آپ آگے بڑھنا چاہتے ہیں اور سی ڈی بوٹر کو نصب کیا جائے؟
zh_cn: 如果您的计算机无法从 CD 启动，本程序将会安装新的启动菜单项，用来帮您从 CD 启动。在大多数情况下，不需要本程序就能直接从 CD-Rom 启动。 您想继续安装 CD 启动器吗？
zh_tw: 如果您的機器無法從該 CD 開機，本程式會安裝新的開機選單條目以幫助您從 CD 開機。大多數情況下並不需要此程式，通常只要將 CD 片置於光碟機裡重新開機即可。 您想要繼續並且安裝 CD 開機程式嗎？

source: An error occurred: %(error)s For more information, please see the log file: %(log)s
ar: وقع خطأ: %(error)s من فضلك طالع على ملف السجل لمزيد من المعلومات: %(log)s
ast: Hebo un error: %(error)s Pa mayor información, mira nel ficheru de rexistru: %(log)s
bg: Възникна грешка: %(error)s За повече информация, моля, вижте дневника: %(log)s
ca: S'ha produït un error: %(error)s Per a obtenir-ne més informació, vegeu-ne el fitxer de registre: %(log)s
cs: Nastala chyba: %(error)s Více informací je dostupných v souboru protokolu: %(log)s
de: Ein Fehler ist aufgetreten: %(error)s Weitere Informationen finden Sie in der Protokolldatei: %(log)s
fi: Tapahtui virhe: %(error)s Lisätietoja lokitiedostossa: %(log)s
gl: Produciuse un erro: %(error)s Para máis información, vexa o ficheiro de rexistro: %(log)s
he: ארעה שגיאה: %(error)s למידע נוסף, יש לעיין בקובץ הרישום: %(log)s
hr: Dogodila se greška: %(error)s Za više informacija, provjerite zapisnik: %(log)s
hu: Hiba történt: %(error)s További információkért nézze meg a naplófájlt: %(log)s
id: Terjadi kesalahan: %(error)s Untuk informasi lebih lanjut, silakan lihat berkas log: %(log)s
it: Si è verificato un errore: %(error)s Per maggiori informazioni, consultare il file con i messaggi di errore: %(log)s
lt: Įvyko klaida: %(error)s Daugiau informacijos sužinosite žurnalo faile: %(log)s
ms: Ada ralat berlaku: %(error)s Untuk maklumat lanjut, sila lihat fail log: %(log)s
nb: En feil oppsto: %(error)s For mer informasjon, vennligst se loggfil: %(log)s
nl: Er is een fout opgetreden: %(error)s Voor meer informatie, zie het logboek: %(log)s
pl: Wystąpił błąd: %(error)s Więcej informacji w pliku dziennika: %(log)s
pt: Ocorreu um erro: %(error)s Para mais informação, consulte o ficheiro de registo: %(log)s
ru: Произошла ошибка: %(error)s Более подробную информацию смотрите в файле журнала: %(log)s
sk: Vyskytla sa chyba: %(error)s Prosím, pre viac informácií si pozrite súbor so záznamom: %(log)s
th: เกิดข้อผิดพลาดขึ้น: %(error)s สำหรับข้อมูลเพิ่มเติม โปรดดูแฟ้มปูม: %(log)s
ur: ایک غلطی ہو گئی: %(error)s مزید معلومات کے لئے ، براہ مہربانی لاگ فائل دیکھیں:‌ %(log)s
zh_cn: 出现一个错误： %(error)s 了解详细信息，请查看日志文件：%(log)s
zh_tw: 遭遇到錯誤： %(error)s 若要取得更多資訊，請查看日誌檔：%(log)s

source: A previous installation was detected in %s. Please uninstall that before continuing.
ar: وُجِد تثبيت سابق في %s. من فضلك أزِل ذلك التثبيت قبل المتابعة.
ast: Deteutose una instalación previa en %s. Por favor desinstálala enantes de siguir.
bg: Беше открита предишна инсталация в %s. Моля, деинсталирайте я преди да продължите.
ca: S'ha detectat una instal·lació anterior a %s. Hauríeu de desinstal·lar-la abans de continuar.
cs: Byla nalezena dřívější instalace v %s. Odinstalujte ji prosím dříve, než budete pokračovat.
de: Es wurde eine bereits existierende Installation in %s gefunden. Bitte deinstallieren Sie diese, bevor Sie fortfahren.
fi: Edellinen asennus havaittiin kohteessa %s. Poista kyseinen asennus ennen jatkamista.
gl: Detectouse unha instalación previa en %s. Desinstálea antes de continuar.
he: התקנה קודמת זוהתה ב־%s. יש להסיר אותה לפני מעבר הלאה.
hr: Pronađena je prethodna instalacija u %s. Molim uklonite je prije nastavka.
hu: Korábbi telepítés található itt: %s. Távolítsa ezt el a folytatás előtt.
id: Pemasangan lama terdeteksi di %s. Silakan bongkar dulu sebelum melanjutkan.
it: È stata rilevata un'installazione precedente in %s. Rimuovere quella prima di continuare.
lt: Aptiktas ankstesnis diegimas %s. Prašome pašalinti prieš tęsiant.
ms: Pemasangan sebelum ini telah dkenalpasti dalam %s. Sila nyahpasang terlebih dahulu sebelum meneruskan.
nb: En tidligere innstallasjon ble funnet i %s. Vennligst avinnstaller før du fortsetter.
nl: Een vorige installatie is gedetecteerd in %s. Verwijder deze voordat u verder gaat.
pt: Foi detectada uma instalação anterior em %s. Por favor desinstale-a antes de continuar.
ru: Предыдущая установка обнаружена в %s. Пожалуйста, удалите её прежде чем продолжить.
sk: Bola zistená predchádzajúca inštalácia v %s. Odinštalujte ju, prosím, pred pokračovaním.
sq: Një instalim i mëparshëm u dallua në %s. Ju lutemi çinstalojeni para se të vazhdoni.
th: ตรวจพบการติดตั้ง %s ครั้งก่อน โปรดถอดถอนมันก่อนดำเนินการต่อ
ur: %s پر ایک گزشتہ تنصیب کے بارے میں پتہ چلا۔ برائے مہربانی آگے بڑھنے سے پہلے اسے غیر تنصیب کریں۔
zh_cn: %s 检测到上次的安装。 请先卸载，然后再继续。
zh_tw: 偵測到 %s 內有上次的安裝。 在繼續之前請將它解除安裝。

source: No CD detected, cannot run CD menu
ar: لم يُكشف عن أي اسطوانات، لذلك لا يمكن تشغيل قائمة الاسطوانة.
ast: Nun se deteutó el CD, nun pue executase'l menú de CD
bg: Не е открит диск. Не може да се стартира CD меню
ca: No s'ha detectat cap CD, per la qual cosa no es pot executar el menú del CD
cs: Nenalezeno CD, nelze spustit nabídku CD
de: Keine CD gefunden, kann das CD-Menü nicht ausführen.
fi: Levyä ei havaittu, ei voida käynnistää valikkoa.
gl: Non se detectou o CD, non pode executarse o menú do CD
he: לא אותר תקליטור, לא ניתן להריץ את תפריט התקליטור
hr: Nije pronađen CD, pokretanje CD izbornika nije moguće
hu: Nem található CD, ezért nem jeleníthető meg a menü
id: CD tidak terdeteksi, tidak dapat menjalankan menu CD
it: Nessun CD rilevato, impossibile avviare il menu del CD
lt: CD neaptiktas, negalima paleisti CD meniu
ms: Tiada CD dikenalpasti, tidak dapat jalankan menu CD
nb: Ingen CD funnet. Kan ikke kjøre CD-meny
nl: Geen cd gedetecteerd, kan het cd-menu niet uitvoeren
pt: Não foi detectado CD, não é possível executar o menu de CD
ru: CD-диск не обнаружен, невозможно запустить CD-меню
sk: Nebolo zistené CD, nemôžem spustiť ponuku CD
sq: Nuk u dallua asnjë CD, nuk mund të nis menunë e CD
th: ไม่พบซีดี, ไม่สามารถเรียกใช้เมนูซีดี
ur: سی ڈی کا پتہ نہیں چلایا جا سکا، سی ڈی مینو نہیں چل سکتا
zh_cn: 未检测到光盘，无法运行光盘菜单
zh_tw: 偵測不到 CD，無法執行 CD 選單

source: Could not find any valid CD. CD boot helper can only be used with a Live CD.
ar: لم يُعثر على أي اسطوانة صالحة. يمكن استخدام مساعد إقلاع الاسطوانات فقط مع اسطوانة حية.
ast: Nun pudo alcontrase dengún CD válidu. L'Asistente d'Arrancador del CD pue usase namái con un Live CD.
bg: Не може да се намери валиден диск. CD помощник за стартиране може да се използва само с Жив диск.
ca: No s'ha trobat cap CD vàlid. L'auxiliar d'arrencada del CD només es pot utilitzar amb un CD autònom.
cs: Nepodařilo se nalézt žádné platné CD. Pomocník pro zavedení z CD může být použit pouze se spustitelným CD.
de: Konnte keine geeignete CD finden. Der CD-Boothelfer kann nur mit einer Live-CD benutzt werden.
fi: Kelvollista levyä ei löydetty. CD-levyltä käynnistymisen aputyökalua voidaan käyttää vain työpöytä-CD:n kanssa.
gl: Non se puido atopar un CD válido. O auxiliar de inicio de CD só pode usarse cun CD vivo.
he: לא ניתן למצוא תקליטור תקני כלשהו. ניתן להשתמש במסייע האתחול מתקליטור רק באמצעות תקליטור חי.
hr: Pronalazak valjanog CD-a nije moguć. Pomoćnik pokretanja s CD-a se može koristiti jedino uz Live CD.
hu: Nem található érvényes CD. A CD-indítási segéd csak live CD-vel használható.
id: Tidak dapat menemukan CD yang valid. Penolong boot CD hanya dapat digunakan dengan LiveCD.
it: Impossibile trovare un CD valido. L'assistente di avvio da CD può essere usato solo da un «Live CD».
lt: Nepavyko rasti teisingo CD. CD paleidimo pagelbiklis gali būti naudojamas tik su Live CD.
ms: Tidak menemui sebarang CD yang sah. Pembantu Mula CD hanya boleh digunakan bersama live CD.
nb: Finner ikke en gyldig CD. CD oppstartshjelper kan bare blir brukt med en LiveCD.
nl: Kon geen geldige cd vinden. Cd-opstarterhelper kan alleen worden gebruikt met een Live-cd.
pt: Não foi possível encontrar um CD válido. O assistente de arranque através de CD só pode ser usado com um Live CD.
ru: Не удалось найти требуемый CD-диск. Помощник загрузки может использоваться только с живым CD.
sk: Nepodarilo sa nájsť platné CD. Pomocník zavádzača CD môže byť používaný len s Live CD.
sq: Nuk munda të gjej asnjë CD të vlefshëm. Nihmësi i nisjes nga CD mund të përdoret vetëm me Live CD.
th: ไม่สามารถค้นหาซีดีที่ถูกต้อง ตัวช่วยบูตซีดีใช้ได้กับ Live CD เท่านั้น
ur: کوئی بھی موزوں سی ڈی نہیں مل سکی۔ سی ڈی بوٹ مدد گار صرف لائیو سی ڈی کے ساتھ استعمال ہو سکتا ہے۔
zh_cn: 没有发现可用的光盘。 光盘启动帮助程序只能在 LiveCD 里运行。
zh_tw: 找不到任何有效的 CD。 CD 開機幫助程式只能用於 Live CD。

source: Your username must start with a lower-case letter.
ar: يجب أن يبدأ إسم المستخدم بحرف صغير.
cs: Vaše uživatelské_jméno musí začít malým písmenem.
de: Ihr Benutzername muss mit einem Kleinbuchstaben beginnen.
ms: Nama pengguna anda mesti bermula dengan huruf kecil.
pl: Nazwa użytkownika musi się zaczynać z małej litery.
ru: Ваше имя пользователя должно начинаться со строчной буквы.
ur: آپ کا صارف نام لازما چھوٹے حروف سے شروع ہونا چاہیے۔
zh_cn: 您的用户名必须以小写字母开头。
zh_tw: 您的使用者名稱必須以小寫字母開頭。

source: Your username must contain only lower-case letters, numbers, hyphens, and underscores.
ar: يجب أن يحتوي إسم المستخدم على أحرف صغيرة و أرقام و علامات وصل و شرطات سفلية فقط.
cs: Vaše uživatelské_jméno musí obsahovat pouze malá písmena, čísla, spojovníky a podtržítka.
de: Ihr Benutzername darf nur Kleinbuchstaben, Ziffern, Bindestriche und Unterstriche enthalten.
ms: Nama pengguna anda mesti mengandungi hanya huruf-huruf kecil, nombor, tanda sempang , dan menggarisi.
pl: Nazwa użytkownika może zawierać tylko małe litery, cyfry, łączniki i podkreślenia.
ru: Ваше имя пользователя может содержать только буквы в нижнем регистре, цифры, дефисы и подчеркивания.
ur: آپ کے صارف نام میں صرف چھوٹے حروف، نمبر، ڈیش کی علامت اور نيچے خط علامت ہونی چاہیے۔
zh_cn: 您的用户名只能包含小写字母、数字、连字符和下划线。
zh_tw: 您的使用者名稱只能包含小寫字母 (a-z)、數字 (0-9)、連字號 (-)、底線 (_)。
