Repository: hakuna-m/wubiuefi
Catalog: po/*.po
Languages: ar, ast, bg, ca, cs, de, fi, gl, he, hr, hu, id, it, lt, ms, nb, nl, pl, pt, ru, sk, sq, th, ur, zh_cn, zh_tw

source: You need to reboot to complete the installation
ar: تحتاج إلى إعادة التشغيل لإكمال التثبيت
ast: Necesites reentamar pa completar la instalación
bg: Трябва да рестартирате, за да се завърши инсталацията
ca: Cal que reinicieu per a completar la instal·lació
cs: K dokončení instalace je nutné restartovat
de: Sie müssen den Rechner neu starten, um die Installation abzuschließen
fi: Käynnistys uudelleen vaaditaan asennuksen valmistumiseksi
gl: Necesita reiniciar para completar a instalación
he: יהיה עליך להפעיל מחדש כדי להשלים את ההתקנה
hr: Da biste dovršili instalaciju, potrebno je ponovno pokretanje računala
hu: A számítógépet újra kell indítani a telepítés befejezéséhez
id: Anda harus reboot untuk menyelesaikan instalasi
it: Per completare l'installazione è necessario riavviare il computer
lt: Diegimui pabaigti reikia įkelti OS iš naujo
ms: Anda perlukan mulakan kembali pc anda untuk melengkapkan pemasangan
nb: Du må starte på nytt for å fullføre installasjonen
nl: U moet de computer opnieuw opstarten om de installatie te voltooien
pl: Należy ponownie uruchomić komputer, aby ukończyć instalację
pt: Precisa reiniciar para completar a instalação
ru: Для завершения установки необходима перезагрузка системы
sk: Potrebujete reštartovať pre dokončenie inštalácie
sq: Ju nevojitet rindezja për të përfunduar instalimin
th: คุณต้องเริ่มระบบใหม่ เพื่อให้การติดตั้งสมบูรณ์
ur: آپ کو تنصیب مکمل کرنے کے لیے کمپیوٹر دوبارہ چلانے کی ضرورت ہے
zh_cn: 安装后您需要重启动电脑
zh_tw: 您需要重新開機以完成安裝程序

source: Reboot now
ar: أعد التشغيل الآن
ast: Reentamar agora
bg: Рестартиране
ca: Reinicia ara
cs: Restartovat nyní
de: Jetzt neu starten
fi: Käynnistä uudelleen nyt
gl: Reiniciar agora
he: הפעלה מחדש כעת
hr: Ponovno pokreni odmah
hu: Újraindítás most
id: Reboot sekarang
it: Riavvia ora
lt: Įkelti OS iš naujo dabar
ms: Mulakan kembali sekarang
nb: Start på nytt nå
nl: Nu herstarten
pl: Zrestartuj teraz
pt: Reiniciar agora
ru: Перезагрузить сейчас
sk: Reštartovať teraz
sq: Rindize tani
th: เริ่มใหม่เดี๋ยวนี้
ur: اب پھر بوٹ کریں
zh_cn: 立即重启
zh_tw: 立刻重新開機

source: I want to manually reboot later
ar: أرغب في إعادة التشغيل لاحقا
ast: Quiero reentamar manualmente lluéu
bg: Ще рестартирам по-късно
ca: Vull reiniciar manualment més tard
cs: Chci restartovat později ručně
de: Ich möchte später selbst neu starten
fi: Haluan käynnistää uudelleen myöhemmin itse
gl: Quero reiniciar manualmente máis tarde
he: ברצוני לבצע הפעלה מחדש ידנית מאוחר יותר
hr: Želim kasnije ručno ponovno pokrenuti
hu: Később szeretném saját kezűleg újraindítani
id: Saya ingin reboot secara manual nanti
it: Riavvio manuale
lt: Aš noriu įkrauti OS iš naujo vėliau
ms: Saya ingin mulakan kembali secara manual nanti
nb: Jeg vil manuelt restarte senere
nl: Ik wil mijn computer later handmatig herstarten
pt: Prefiro reiniciar mais tarde (manualmente)
ru: Перезагрузить позже
sk: Chcem neskôr reštartovať ručne
sq: Dua ta rindez në mënyrë manuale më vonë
th: ฉันต้องการเริ่มระบบใหม่ด้วยตัวเองภายหลัง
ur: میں چاہتا ہوں کہ بعد میں خود سے پھر بوٹ کروں
zh_cn: 我想稍后自己重启动
zh_tw: 我想要稍後手動重新開機

source: < Back
ar: < للخلف
ast: < Tornar
bg: < Назад
ca: < Enrere
cs: < Předchozí
de: < Zurück
fi: < Edellinen
gl: < Atrás
he: < הקודם
hr: < Natrag
hu: < Vissza
id: < Kembali
it: < Indietro
lt: < Atgal
ms: < Balik
nb: < Tilbake
nl: < Vorige
pl: < Wstecz
pt: < Retroceder
ru: < Назад
sk: < Spät
sq: < Mbrapsht
th: < ย้อนกลับ
ur: < واپس
zh_cn: < 上一步
zh_tw: < 上一步

source: Reboot required
ar: إعادة التشغيل مطلوبة
ast: Requierse reentamar
bg: Необходимо е рестартиране
ca: Cal que reinicieu el sistema
cs: Vyžadován restart
de: Neustart erforderlich
fi: Käynnistys uudelleen vaaditaan
gl: Requírese o reinicio
he: נדרש איתחול
hr: Potrebno je ponovno pokretanje računala
hu: Újraindítás szükséges
id: Diperlukan reboot
it: Richiesto riavvio
lt: Reikia įkelti OS iš naujo
ms: Perlu Mulakan kembali
nb: Omstart påkrevd
nl: Herstart vereist
pl: Wymagane ponowne uruchomienie komputera
pt: Necessário reiniciar
ru: Требуется перезагрузка
sk: Je potrebný reštart
sq: Kërkohet rindezja
th: ต้องการเริ่มระบบใหม่
ur: ری بوٹ کی ضرورت
zh_cn: 需要重启
zh_tw: 須要重新開機

source: To start the Live CD you need to reboot your machine leaving the CD in the tray. If your machine cannot boot from the CD, the last option should work in most cases.
ar: لبدء الاسطوانة الحية تحتاج إلى إعادة تشغيل الجهاز مع إبقاء الاسطوانة داخل قارئ الاسطوانات. و إذا لم يستطع جهازك الإقلاع من الاسطوانة فجرّب الخيار الأخير حيث أنه يفلح في معظم الحالات.
ast: P'aniciar el Live CD necesites reaniciar l'equipu dexando'l CD dientro de la unidá. Si l'equipu nun puede arrancar dende'l CD, la cabera opción tien de sirvir na mayoría de los casos.
bg: За да стартирате Живия диск, трябва да рестартирате компютъра с диска в дисковото устройство. Ако вашата система не може да стартира от диск, опцията накрая трябва да работи в повечето случаи.
ca: Per a iniciar el CD autònom cal que reinicieu l'ordinador i hi deixeu el CD a la safata. Si aquest no pot arrencar des del CD, la darrera opció hauria de funcionar en la majoria dels casos.
cs: Ke spuštění live CD musíte restartovat počítač a ponechat CD v mechanice. Pokud počítač neumí startovat z CD, většinou by měla pomoci poslední položka.
de: Um die Live-CD zu starten, müssen Sie den Rechner mit der CD-ROM im Laufwerk neu starten. Wenn Ihr Rechner nicht von der CD-ROM starten kann, sollte die letzte Option in den meisten Fällen funktionieren.
fi: Käynnistä tietokone uudelleen CD-levyn ollessa asemassa siirtyäksesi esittelyyn. Jos tietokone ei käynnisty levyltä, viimeisen valinnan pitäisi auttaa.
gl: Para probar o Live CD precisa reiniciar o seu computador deixando o CD na bandexa. Se o seu computador non pode iniciar desde o CD, a última opción debería funcionar na maior parte dos casos.
he: כדי להפעיל את התקליטור החי (תמחישור) יהיה עליך לאתחל את המחשב ולהשאיר את התקליטור בכונן. אם המחשב שלך לא יכול לאתחל מתקליטור, האפשרות האחרונה אמורה לעבוד ברב המקרים.
hr: Da biste pokrenuli Live CD trebate ponovno pokrenuti računalo s CD-om u računalu. Ako vaše računalo ne može učitati sustav s CD-a, posljednja opcija bi trebala funkcionirati u većini slučajeva.
hu: A Live CD elindításához újra kell indítani a gépet és a meghajtóban kell hagyni a CD-t. Ha a gépe nem képes CD-ről indulni, akkor válassza az utolsó lehetőséget.
id: Untuk menjalankan Live CD Anda perlu reboot komputer Anda dengan CD berada dalam CD-ROM. Jika komputer Anda tidak dapat boot dari CD, silakan coba pilihan terakhir.
it: Per lanciare il «Live CD» è necessario riavviare il computer lasciando il CD nel lettore. Se il computer non è in grado di avviarsi dal CD, l'ultima opzione dovrebbe funzionare nella maggior parte dei casi.
lt: Norėdami paleisti Live CD turite įkelti OS iš naujo palikę įdėtą CD. Jeigu jūsų kompiuteris negali pasileisti iš CD, paskutinis punktas turėtų jums tikti.
ms: Untuk memulakan Live CD, anda perlu mulakan kembali komputer dengan meninggalkan CD didalam traynya. Jika kompuer anda tidak dapat bermula dengan CD, pilihan terakhir biasanya boleh dalam kebanyakkan kes
nb: For å starte fra Live CD må du starte om maskinen din og la CDen stå i. Hvis din maskin ikke kan starte fra CDen, vil det siste alternativet fungere i de fleste tilfeller.
nl: Om de Live-cd te starten, moet u uw computer herstarten met de cd in de lade. Als uw computer niet kan opstarten van cd, zou de laatste optie in de meeste gevallen moeten werken.
pl: Aby uruchomić LiveCD należy uruchomić komputer ponownie zostawiając płytę CD w napędzie. Jeśli komputer nie może zostać uruchomiony z płyty CD ostatnia opcja powinna zadziałać w większości wypadków.
pt: Para iniciar o Live CD necessita de reiniciar o seu computador deixando o CD na drive de discos. Se o seu computador não puder arrancar através do CD então a última opção deverá funcionar na maioria dos casos.
ru: Для загрузки живого CD необходимо перезагрузить компьютер, оставив диск в приводе. Если ваш компьютер не может загрузиться с CD, попробуйте последний вариант, который срабатывает в большинстве случаев.
sk: Na spustenie LiveCD potrebujete reštartovať váš počítač s CD v mechanike. Ak váš počítač nemožno zaviesť z CD, posledná voľba by mala fungovať vo väčšine prípadov.
sq: Për të nisur Live CD ju duhet ta rindizni makinën tuaj duke e lënë CD në fole. Nëse makina juaj nuk mund të nisë nga CD, opsioni i fundit do të punojë në shumicën e rasteve.
th: เพื่อเริ่มใช้ Live CD คุณจำเป็นต้องเริ่มระบบใหม่โดยปล่อยซีดีไว้ในถาด ถ้าเครื่องของคุณไม่สามารถบูตจากซีดีได้ ตัวเลือกสุดท้ายควรใช้ได้ในกรณีส่วนใหญ่
ur: لائیو سی ڈی کو چلانے کے لیے ضروری ہے کہ آپ سی ڈی کو ٹرے میں چھوڑ کر مشین دوبارہ بوٹ کریں۔ اگر آپ کی مشین سی ڈی سے بوت نہیں کر سکتی، تو آخری آپشن کو زیادہ تر واقعات میں چلنا چاہیے۔
zh_cn: 要从 Live CD 启动，您需要将 CD 放在光驱中并重启计算机。如果您的计算机无法从 CD 启动，最后一个选项应该在大多数情况下可用。
zh_tw: 要啟動此 Live CD，你需要把此光碟留在光碟機並重新開機。如果您的電腦不能用此 CD 開機，最後一個選項應該可以幫助您。

source: I want to manually reboot Later
ar: أرغب في إعادة التشغيل لاحقاً
ast: Quiero reentamar manualmente lluéu
bg: Ще рестартирам по-късно
ca: Vull reiniciar manualment més tard
cs: Chci ručně restartovat později
de: Ich möchte später selbst neu starten
fi: Haluan käynnistää uudelleen myöhemmin itse
gl: Quero reiniciar manualmente máis tarde
he: אבצע הפעלה מחדש בעצמי מאוחר יותר
hr: Želim kasnije ručno ponovno pokrenuti računalo
hu: Később szeretném saját kezűleg újraindítani
id: Saya ingin reboot secara manual nanti
it: Riavvio manuale
lt: Aš noriu įkrauti OS iš naujo vėliau
ms: Saya ingin mulakan kembali secara manual nanti
nb: Jeg vil starte på nytt senere
nl: Ik wil mijn computer later handmatig herstarten
pl: Chcę później zrestartować komputer ręcznie
pt: Prefiro reiniciar mais tarde (manualmente)
ru: Я хочу перезагрузить компьютер позже
sk: Chcem neskôr reštartovať ručne
sq: Dua ta rindez në mënyrë manuale më vonë
th: ฉันต้องการเริ่มระบบใหม่ด้วยตัวเองในภายหลัง
ur: میں‌ چاہتا ہوں کہ خود بعد میں ری بوٹ کروں
zh_cn: 我想稍后自己重启
zh_tw: 我想要稍後手動重新開機

source: Help me to boot from CD
ar: ساعدني في الإقلاع من الاسطوانة
ast: Aidame a arrancar dende'l CD
bg: Помогни ми да стартирам от диск
ca: Ajuda'm a arrencar des del CD
cs: Potřebuji pomoci s nastartováním z CD
de: Hilfe zum Starten von der CD
fi: CD-levyltä käynnistämisen aputyökalu
gl: Axúdeme a iniciar desde o CD
he: עזור לי לאתחל מתקליטור
hr: Pomogni mi učitati s CD-a
hu: Segítség a CD-ről való induláshoz.
id: Bantu saya agar dapat boot dari CD
it: Avvio da CD assistito
lt: Padėkite man paleisti iš CD
ms: Bantu saya untuk boot dari CD
nb: Hjelp meg med å starte opp fra CD
nl: Help mij om van cd op te starten
pl: Pomoc w rozruchu z CD
pt: Ajude-me a iniciar através do CD
ru: Помощь в загрузке с CD
sk: Pomoc so spustením z CD
sq: Më ndihmoni në nisjen nga CD
th: ช่วยฉันบูตจากซีดี
ur: سی ڈی سے بوٹ کرنے میں میری مدد کریں
zh_cn: 帮助我从光盘启动
zh_tw: 幫助我從 CD 開機

source: Accessibility profile
ar: لاحة الإتاحة
ast: Perfil d'accesibilidá
bg: Настройки на достъпност
ca: Perfil d'accessibilitat
cs: Profil přístupnosti
de: Barrierefreiheitsprofil
fi: Esteettömyysprofiili
gl: Perfil de accesibilidade
he: פרופיל נגישות
hr: Profil pristupačnosti
hu: Akadálymentesítési profil
id: Profil aksesibilitas
it: Profilo di accessibilità
lt: Pritaikymo neįgaliesiems profilis
ms: Profil kebolehan mengakses
nb: Tilgjengelighetsprofil
nl: Toegankelijkheidsprofiel
pl: Profil dostępności
pt: Perfil de acessibilidade
ru: Профиль доступности
sk: Profil prístupnosti
sq: Profili i hyrjes
th: โปรไฟล์สิ่งอำนวยความสะดวก
ur: رسائی پروفائل
zh_cn: 可用性配置
zh_tw: 輔助功能個人設定檔

source: Please select the appropriate accessibility profile
ar: اختر لاحة الإتاحة الملائمة من فضلك
ast: Por favor, seleicione'l perfil d'accesibilidá afayaízu
bg: Моля, изберете подходящи настройки на достъпност
ca: Trieu el perfil d'accessibilitat apropiat per a vós
cs: Prosím vyberte odpovídající profil přístupnosti
de: Bitte wählen Sie das passende Barrierefreiheitsprofil
fi: Valitse sopiva esteettömyysprofiili
gl: Por favor, seleccione o perfil de accesibilidade apropiado
he: נא לבחור את פרופיל הנגישות הרצוי
hr: Molim odaberite prikladan profil pristupačnosti
hu: Válassza ki a megfelelő akadálymentesítési profilt
id: Silakan memilih profil aksesibilitas yang sesuai.
it: Scegliere il profilo più adatto alle proprie esigenze
lt: Prašome nurodyti tinkamą pritaikymo neįgaliesiems profilį
ms: Sila pilih profil kebolehan mengakses yang sesuai
nb: Vennligst velg egnet tilgjengelighetsprofil
nl: Kies het gewenste toegankelijkheidsprofiel
pl: Proszę wybrać odpowiedni profil dostępności
pt: Por favor seleccione o perfil de acessibilidade apropriado
ru: Пожалуйста, выберите подходящий профиль доступности
sk: Prosím, zvoľte vhodný profil prístupnosti
sq: Ju lutemi zgjidhni profilin e duhur të hyrjes
th: โปรดเลือกโปรไฟล์สิ่งอำนวยความสะดวกที่เหมาะสม
ur: مناسب رسائی پروفائل کا انتخاب کریں
zh_cn: 请选择合适的可用性配置
zh_tw: 請選取適當的輔助功能個人設定檔

source: Next >>
ar: التالي >>
ast: Siguir >>
bg: Напред >>
ca: Següent >>
cs: Další >>
de: Weiter >>
fi: Seuraava >>
gl: Seguinte >>
he: הבא >>
hr: Naprijed >>
hu: Következő >>
id: Lanjut >>
it: Avanti >>
lt: Toliau >>
ms: Seterusnya >>
nb: Neste >>
nl: Volgende >>
pl: Naprzód >>
pt: Seguinte >>
ru: Далее >>
sk: Ďalej >>
sq: Tjetër >>
th: ถัดไป >>
ur: اگلا >>
zh_cn: 下一步 >>
zh_tw: 下一頁 >>

source: Visibility Aids
ar: مساعدات الرؤية
ast: Aides de visibilidá
bg: Помощ при ограничено зрение
ca: Ajudes a la visualització
cs: Pomůcky se zrakem
de: Visuelle Hilfen
fi: Näkyvyysavut
gl: Axudas de visualización
he: עזרי תצוגה
hr: Vizualna pomagala
hu: Láthatósági segítség
id: Bantuan Penglihatan
it: Assistenza visiva
lt: Matomumo pagalba
ms: Bantuan Penglihatan
nb: Synlighetshjelpemidler
nl: Toegankelijkheidshulp voor visuele weergave
pl: Wspomaganie wizualne
pt: Ajuda de visibilidade
ru: Средства для людей с ограниченным зрением
sk: Pomôcky pre nevidiacich
sq: Ndihmë me Pamjen
ur: دیکھائی کی مدد
zh_cn: 视觉障碍辅助工具
zh_tw: 視覺輔助

source: Visibility1
ar: الرؤية ١
ast: Visibilidá1
ca: Visibilitat1
cs: Viditelnost1
de: Visuelles Profil 1
fi: Näkökyky1
gl: Visibilidade1
he: חזות1
hr: Vidljivost1
hu: Láthatóság1
id: Visibilitas1
it: Visibilità 1
lt: Matomumas1
ms: Penglihatan1
nb: Visibilitet1
pt: Visibilidade1
ru: Видимость1
sk: Viditeľnosť1
sq: Pamja1
ur: دکھائی1
zh_cn: 可视性 1
zh_tw: 視覺1

source: Visibility2
ar: الرؤية ٢
ast: Visibilidá2
ca: Visibilitat2
cs: Viditelnost2
de: Visuelles Profil 2
fi: Näkökyky2
gl: Visibilidade2
he: חזות2
hr: Vidljivost2
hu: Láthatóság2
id: Visibilitas2
it: Visibilità 2
lt: Matomumas2
ms: Penglihatan2
nb: Visibilitet2
pt: Visibilidade2
ru: Видимость2
sk: Viditeľnosť2
sq: Pamja2
ur: دکھائی2
zh_cn: 可视性 2
zh_tw: 視覺2

source: Visibility3
ar: الرؤية ٣
ast: Visibilidá2
ca: Visibilitat3
cs: Viditelnost3
de: Visuelles Profil 3
fi: Näkökyky3
gl: Visibilidade3
he: חזות3
hr: Vidljivost3
hu: Láthatóság3
id: Visibilitas3
it: Visibilità 3
lt: Matomumas3
ms: Penglihatan3
nb: Visibilitet3
pt: Visibilidade3
ru: Видимость3
sk: Viditeľnosť3
sq: Pamja3
ur: دیکھائی3
zh_cn: 可视性 3
zh_tw: 視覺3

source: Braille
ar: بريل
bg: Брайл
cs: Braillovo písmo
fi: Pistekirjoitus
he: ברייל
hr: Brailleovo pismo
id: Braile
lt: Brailio
ru: Шрифт Брайля
sk: Brailovo písmo
th: เบรลล์
ur: بریل
zh_cn: 布莱叶盲文
zh_tw: 盲人點字

source: Mobility Aids
ar: مساعدات الحركة
ast: Aides de movilidá
bg: Помощ при ограничена подвижност
ca: Ajudes de mobilitat
cs: Pomůcky s pohyblivostí
de: Mobilitätshilfen
fi: Liikkuvuusavut
gl: Axudas de movilidade
he: עזרי ניידות
hr: Pomagala pokretljivosti
hu: Mobilitási segítség
id: Bantuan Mobilitas
it: Assistenza motoria
lt: Judėjimo pagalba
ms: Bantuan Mobiliti
nb: Beveglighetshjelpemidler
nl: Toegankelijkheidshulp voor invoer
pl: Wspomaganie motoryczne
pt: Ajuda de mobilidade
ru: Средства для людей с ограниченными двигательными способностями
sk: Pomôcky s pohyblivosťou
sq: Ndihmë Lëvizshmërie
ur: موبلٹی ایڈز
zh_cn: 行动障碍辅助工具
zh_tw: 行動輔助

source: Mobility1
ar: الحركة ١
ast: Movilidá1
ca: Mobilitat1
cs: Mobilita1
de: Mobilitätsprofil 1
fi: Liikuntarajoitteisuus1
gl: Mobilidade1
he: ניידות1
hr: Pokretljivost1
hu: Mobilitás1
id: Mobilitas1
it: Mobilità 1
lt: Mobilumas1
ms: Mobiliti1
nb: Mobilitet1
pt: Mobilidade1
ru: Профиль подвижности 1
sk: Pohyblivosť1
sq: Lëvizshmëria1
ur: موبلٹی1
zh_cn: 可行动性 1
zh_tw: 行動1

source: Mobility2
ar: الحركة ٢
ast: Movilidá2
ca: Mobilitat2
cs: Mobilita2
de: Mobilitätsprofil 2
fi: Liikuntarajoitteisuus2
gl: Mobilidade2
he: ניידות2
hr: Pokretljivost2
hu: Mobilitás2
id: Mobilitas2
it: Mobilità 2
lt: Mobilumas2
ms: Mobiliti2
nb: Mobilitet2
pt: Mobilidade2
ru: Профиль подвижности 2
sk: Pohyblivosť2
sq: Lëvizshmëria2
ur: موبلٹی2
zh_cn: 可行动性 2
zh_tw: 行動2

source: None
ar: لا شيء
ast: Dengún
bg: Нищо
ca: Cap
cs: Žádný
de: Kein(e)
fi: Ei mitään
gl: Ningún
he: ללא
hr: Ništa
hu: Nincs
id: Tidak ada
it: Nessuno
lt: Nieko
ms: Tiada
nb: Ingen
nl: Geen
pl: Brak
pt: Nenhum
ru: Отсутствует
sk: Žiadny
sq: Asnjë
th: ไม่มี
ur: کچھ نہیں
zh_cn: 无
zh_tw: 無

source: %s Menu
ar: قائمة %s
ast: Menú de %s
bg: %s меню
ca: Menú %s
cs: Nabídka %s
de: %s Menü
fi: %s - valikko
gl: %s Menú
he: תפריט %s
hr: %s Izbornik
hu: %s menü
id: Menu %s
it: Menu di %s
lt: %s meniu
ms: Menu %s
nb: %s Meny
ru: %s Меню
sk: %s Ponuka
th: เมนู %s
ur: %s مینو
zh_cn: %s 菜单
zh_tw: %s 選單

source: Demo and full installation
ar: التشغيل التجريبي والتثبيت الكامل
ast: Demostración ya instalación completa
bg: Демонстрация и пълна инсталация
ca: Demostració i instal·lació completa
cs: Ukázka a plná instalace
de: Demo und Vollinstallation
fi: Esittely ja täysi asennus
gl: Demo e instalación completa
he: הדגמה והתקנה מלאה
hr: Demonstracija i potpuna instalacija
hu: Bemutató és teljes telepítés
id: Demo dan instalasi penuh
it: Prova e installa
lt: Demonstracija ir pilnas diegimas
ms: Demo dan pemasangan penuh
nb: Demo og full installasjon
nl: Demo en volledige installatie
pl: Demonstracja i pełna instalacja
pt: Demonstração e instalação completa
ru: Демо и полная установка
sk: Skúšobná a plná inštalácia
sq: Demo dhe instalim i plotë
th: ทดลองและการติดตั้งเต็มรูปแบบ
ur: ڈیمو اور مکمل کی تنصیب
zh_cn: 演示和完全安装
zh_tw: 展示和完整安裝
