Repository: hakuna-m/wubiuefi
Catalog: po/*.po
Languages: ar, ast, bg, ca, cs, de, fi, gl, he, hr, hu, id, it, lt, ms, nb, nl, pl, pt, ru, sk, sq, th, ur, zh_cn, zh_tw

source: The installation failed. Logs have been saved in: %s. Note that in verbose mode, the logs may include the password. The system will now reboot.
ar: فشلت عملية التثبيت. حُفظت السجلات في: %s. لاحظ أنه في طور الإطناب قد تشتمل السجلات على كلمة السر. سيعاد تشغيل النظام الآن.
ast: Falló la instalación. Guardáronse rexistros en: %s. Decátate que nel mou detalláu los rexistros seique amuesen la clave. El sistema va reentamar agora.
bg: Инсталацията е неуспешна. Дневниците са запазени в: %s. Знайте, че в многословен режим, дневниците могат да включват и паролата. Сега системата ще се рестартира.
ca: Ha fallat la instal·lació. Se n'han desat els registres a: %s. Tingueu en compte que en mode detallat pot ser que aquests incloguin la contrasenya. Ara es reiniciarà el sistema.
cs: Instalace se nezdařila. Protokoly byly zaznamenány do: %s. Vězte, že ve výřečném režimu mohou protokoly obsahovat heslo. Systém se nyní restartuje.
de: Die Installation ist fehlgeschlagen. Protokolle wurden gespeichert: %s. Beachten Sie, dass die Protokolle im ausführlichen Modus eventuell das Passwort beinhalten. Das System startet jetzt neu.
fi: Asennus epäonnistui. Lokit on tallennettu kansioon: %s. Huomaa että yksityiskohtaisessa tilassa lokit saattavat sisältää salasanan. Järjestelmä käynnistyy nyt uudelleen.
gl: A instalación fallou. Gardouse un rexistro en: %s. Saiba que en modo detallado, os rexistros poden incluír o contrasinal. O sistema reiniciarse agora.
he: ההתקנה נכשלה. קובצי היומן נשמרו תחת : %s נא לשים לב כי במצב verbose, היומן עלול להכיל את הסיסמה. המערכת תופעל מחדש כעת.
hr: Instalacija nije uspjela. Zapisnici će biti spremljeni u: %s. Napomena: zapisnici u opširnoj varijanti mogu sadržavati lozinku. Sustav će se sada ponovno pokrenuti.
hu: A telepítés meghiúsult. A naplók a következő helyen találhatók: %s. Ne feledje, hogy részletes módban a naplók tartalmazhatják a jelszót. A rendszer most újraindul.
id: Instalasi gagal. Log telah disimpan di: %s. Perlu diketahui dalam modus verbose, log akan menyertakan kata sandi. Sistem sekarang akan reboot.
it: L'installazione non è riuscita. I messaggi di errore sono stati salvati in: %s. Nella modalità prolissa, i messaggi potrebbero contenere la password. Il sistema verrà riavviato.
lt: Diegimas nepavyko. Žurnalai išsaugoti čia: %s. Pastebėkite, kad išsamios informacijos režime žurnaluose gali būti slaptažodis. Operacinė sistema bus įkelta iš naujo.
ms: Pemasangan gagal. Catatan telah disimpan di: %s. Sila ambil perhatian, dalam mod verbose catatan tersebut mungkin mengandungi kata laluan. Sistem akan di-but semula.
nb: Innstallasjonen feilet. Logger har blitt lagret i: %s. Merk at i verbosemodus, kan loggene inkludere passordet. Systemet vil nå starte på nytt.
nl: De installatie is mislukt. Logboeken zijn opgeslagen in: %s. Let op dat in de gedetailleerde modus het wachtwoord in het logboek kan staan. Het systeem zal nu opnieuw opstarten.
pl: Nie udało się zakończyć instalacji poprawnie. Dziennik przebiegu instalacji zapisano w pliku %s. Proszę wziąć pod uwagę, że w trybie szczegółowych komunikatów dziennik może zawierać wprowadzone hasło. Komputer zostanie ponownie uruchomiony.
pt: A instalação falhou. Os registos foram guardados em: %s. Note que em modo de detalhe, os registos poderão incluir a password. O sistema irá agora reiniciar.
ru: Не удалось выполнить установку. Журналы установки сохранены в: %s. Обратите внимание — в подробном режиме журналы могут содержать пароль. Система будет перезагружена.
sk: Inštalácia zlyhala. Záznam bol uložený do: %s. Poznámka pre podrobný režim, záznamy môžu obsahovať heslo. Systém bude teraz reštartovaný.
th: การติดตั้งล้มเหลว ปูมบันทึกถูกเก็บไว้แล้วที่: %s หมายเหตุดังกล่าวอยู่ใน verbose mode, ปูมบันทึกอาจผนวกรหัสผ่านนั้นไว้ด้วย ระบบจะเริ่มใหม่ในตอนนี้
ur: انسٹالیشن فیل ہو گئی۔ لاگ %s مقام پر محفوظ کر دی گئی توجہ فرمائی، لکھائی موڈ میں لاگز کے اندر پاسورڈ ہو سکتا ہے اب سسٹم ری بوٹ کرئے گا۔
zh_cn: 安装失败。日志已保存至：%s。 注意在 verbose 模式，日志中可能包含密码。 系统现在将重新启动。
zh_tw: 安裝失敗。日誌已儲存於：%s。 請注意到在詳細模式下，日誌內可能包含密碼。 系統將會重新開機。

source: 0s
ar: 0ث
bg: 0с
he: 0שנ'
hu: 0 mp
id: 0d
ru: 0с
th: 0 วินาที
ur: 0 سکینڈ
zh_cn: 0 秒
zh_tw: 0 秒

source: %ih
ar: %iه
bg: %iч
he: %iשע'
hu: %i ó
id: %ij
nl: %iu
ru: %iч
ur: %i گھنٹے
zh_cn: %i 小时
zh_tw: %i 小時

source: %imin
ar: %iدقيقة
bg: %iмин
he: %iד'
hu: %i perc
id: %imen
ru: %iмин
ur: %i‌ منٹ
zh_cn: %i 分钟
zh_tw: %i 分鐘

source: %is
ar: %iث
bg: %iс
he: %iשנ'
hu: %i mp
id: %id
ru: %iс
ur: %i‌ سکینڈ
zh_cn: %i 秒
zh_tw: %i 秒

source: Downloading %s
ar: يُنزل %s
ast: Baxandose %s
bg: Изтегляне на %s
ca: S'està baixant %s
cs: Stahuje se %s
de: %s wird heruntergeladen
fi: Noudetaan %s
gl: Descargando %s
he: מתבצעת הורדת %s
hr: Preuzimanje %s
hu: %s letöltése
id: Mengunduh %s
it: Scaricamento di %s
lt: Siunčiama %s
ms: Muat turun %s
nb: Laster ned %s
nl: %s downloaden
pl: Pobieranie %s
pt: A transferir %s
ru: Загрузка %s
sk: Sťahuje sa %s
sq: Duke shkarkuar %s
th: กำลังดาวน์โหลด %s
ur: ڈاؤن لوڈنگ %s
zh_cn: 正在下载 %s
zh_tw: 正在下載 %s

source: Selecting the target directory
ar: يختار الدليل الهدف
ast: Escoyendo el direutoriu oxetivu
bg: Избиране на целева папка
ca: S'està seleccionant el directori de destinació
cs: Zvolit cílovou složku
de: Zielverzeichnis wählen
fi: Valitaan kohdehakemisto
gl: Selección do cartafol de destino
he: בחירת תיקיית היעד
hr: Odabir ciljnog direktorija
hu: Célkönyvtár kiválasztása
id: Memilih direktori tujuan
it: Selezione della directory di destinazione
lt: Pasirinkite paskirties katalogą
ms: Memilih direktori tujuan
nb: Velg destinasjonskatalog
nl: Doelmap selecteren
pl: Proszę wybrać katalog docelowy
pt: A seleccionar o directório de destino
ru: Выбор каталога для установки
sk: Vyberá sa cieľový adresár
sq: Duke zgjedhur direktorinë shënjestër
th: กำลังเลือกไดเรกทอรีเป้าหมาย
ur: ٹارگٹ ڈائریکٹری منتخب کریں
zh_cn: 选择目标目录
zh_tw: 正在選取目標目錄

source: Creating the installation directories
ar: يختار أدلة التثبيت
ast: Creando los direutorios d'instalación
bg: Създаване на инсталационните папки
ca: S'estan creant els directoris d'instal·lació
cs: Vytváření instalačních složek
de: Installationsordner wird erstellt
fi: Luodaan asennushakemistoja
gl: Creación dos cartafoles de instalación
he: יצירת תיקיות ההתקנה
hr: Stvaranje instalacijskih direktorija
hu: Telepítési könyvtárak létrehozása
id: Membuat direktori instalasi
it: Creazione delle directory di installazione
lt: Kuriami diegimo katalogai
ms: Menghasilkan direktori bagi pemasangan
nb: Oppretter installasjonskataloger
nl: Installatiemappen aanmaken
pl: Tworzenie katalogów dla instalacji
pt: A criar as pastas de instalação
ru: Создание каталогов для установки
sk: Vytvárajú sa inštalačné adresáre
sq: Duke krijuar direktoritë e instalimit
th: กำลังสร้างไดเรกทอรีติดตั้ง
ur: انسٹالیشن ڈائریکٹریز بناتے ہوئے
zh_cn: 创建安装目录
zh_tw: 正在建立安裝目錄

source: Uncompressing files
ar: يفك ضغط الملفات
ast: Descomprimiendo ficheros
bg: Извличане на файлове
ca: S'estan descomprimint els fitxers
cs: Rozbalování souborů
de: Dateien werden entpackt
fi: Puretaan tiedostoja
gl: Descompresión dos ficheiros
he: פריסת הקבצים מתבצעת
hr: Raspakiravanje datoteka
hu: Fájlok kibontása
id: Uncompressing berkas
it: Estrazione dei file
lt: Išskleidžiami failai
ms: Menyahmampatkan fail-fail
nb: Pakker ut filer
nl: Bestanden uitpakken
pl: Rozpakowywanie plików
pt: A descomprimir os ficheiros
ru: Распаковка файлов
sk: Rozbaľujú sa súbory
sq: Duke çngjeshur skedarët
th: กำลังแตกย่อยแฟ้ม
ur: فائلوں‌ کو کشید (ایکسٹریکٹ) کرتے ہوئے
zh_cn: 解压文件
zh_tw: 正在解壓縮檔案

source: Creating the uninstaller
ar: ينشئ مزيل التثبيت
ast: Creando el desinstalador
bg: Създаване на програма за деинсталиране
ca: S'està creant el desinstal·lador
cs: Vytváření odinstalátoru
de: Deinstallationsprogramm wird erstellt
fi: Luodaan asennuksen poisto-ohjelmaa
gl: Creación do desinstalador
he: יצירת תוכנית ההסרה
hr: Stvaranje programa za uklanjanje
hu: Az eltávolító létrehozása
id: Membuat uninstaller
it: Creazione del programma di rimozione
lt: Kuriama šalinimo programa
ms: Menghasilkan Penyahpasang
nb: Oppretter avinnstallerer
nl: Verwijderingsprogramma aanmaken
pl: Tworzenie programu odinstalowującego
pt: A criar o desinstalador
ru: Создание программы удаления
sk: Vytvára sa odinštalátor
sq: Duke krijuar çinstaluesin
th: กำลังสร้างตัวถอดถอนการติดตั้ง
ur: ان انسٹالر بناتے ہوئے
zh_cn: 创建卸载程序
zh_tw: 正在建立解除安裝程式

source: Copying installation files
ar: ينسخ ملفات التثبيت
ast: Copiando los ficheros d'instalación
bg: Копиране на инсталационните файлове
ca: S'estan copiant els fitxers d'instal·lació
cs: Kopírování instalačních souborů
de: Installationsdateien werden kopiert
fi: Kopioidaan asennustiedostoja
gl: Copia dos ficheiros de instalación
he: העתקת קובצי ההתקנה
hr: Kopiranje instalacijskih datoteka
hu: Telepítőfájlok másolása
id: Menyalin berkas instalasi
it: Copia dei file di installazione
lt: Kopijuojami diegimo failai
ms: Menyalin fail-fail pemasangan
nb: Kopierer installasjonsfiler
nl: Installatiebestanden kopiÃ«ren
pl: Kopiowanie plików instalacji
pt: A copiar os ficheiros de instalação
ru: Копирование установочных файлов
sk: Kopírujú sa inštalačné súbory
sq: Duke kopjuar skedarët e instalimit
th: กำลังสำเนาแฟ้มการติดตั้ง
ur: انسٹالیشن فائلیں‌ کاپی کرتے ہوئے
zh_cn: 复制安装文件
zh_tw: 正在複製安裝檔案

source: Retrieving installation files
ar: يجلب ملفات التثبيت
ast: Trayendo los ficheros d'instalación
bg: Изтегляне на инсталационни файлове
ca: S'estan recuperant els fitxers d'instal·lació
cs: Získávání instalačních souborů
de: Installationsdateien werden empfangen
fi: Noudetaan asennustiedostoja
gl: Recuperación dos ficheiros de instalación
he: איחזור קובצי ההתקנה
hr: Preuzimanje instalacijskih datoteka
hu: Telepítőfájlok lekérése
id: Menerima berkas instalasi
it: Recupero dei file di installazione
lt: Gaunami diegimo failai
ms: Mendapatkan fail pemasangan
nb: Henter installasjonsfiler
nl: Installatiebestanden ophalen
pl: Pobieranie plików instalacji
pt: Obtendo os ficheiros para instalação
ru: Получение установочных файлов
sk: Získavajú sa inštalačné súbory
sq: Duke marrë skedarët e instalimit
th: กำลังรับแฟ้มติดตั้ง
ur: انسٹالیشن فائلیں‌ حاصل کرتے ہوئے
zh_cn: 检索安装文件
zh_tw: 正在接收安裝檔案

source: Extracting the kernel
ar: يستخرج النواة
ast: Extrayendo'l núcleu
bg: Извличане на ядрото
ca: S'està extraient el nucli
cs: Rozbalování jádra
de: Kernel wird entpackt
fi: Puretaan ydintä
gl: Extracción do núcleo
he: חילוץ הליבה
hr: Raspakiravanje kernela
hu: A rendszermag kibontása
id: Mengekstrak kernel
it: Estrazione del kernel
lt: Išskleidžiamas branduolys
ms: Mengekstrak kernel
nb: Pakker ut kjernen
nl: Kernel uitpakken
pl: Rozpakowywanie jądra systemu
pt: A extrair o kernel
ru: Извлечение ядра
sk: Rozbaľuje sa jadro
sq: Duke nxjerrë kernelin
th: กำลังแตกย่อยเคอร์เนล
ur: کرنل کو کشید کرتے ہوئے
zh_cn: 展开内核
zh_tw: 正在抽出核心

source: Choosing disk sizes
ar: يختار أحجام القرص
ast: Escoyendo tamaños de discu
bg: Избиране на размери на дискове
ca: S'estan triant les mides de disc
cs: Výběr velikosti disku
de: Festplattengröße wird gewählt
fi: Valitaan levykokoja
gl: Elección dos tamaños de disco
he: בחירת נפחי הכוננים
hr: Odabir veličina diskova
hu: Lemezméretek választása
id: Memilih ukuran disk
it: Scelta dimensioni del disco
lt: Parenkami diskų dydžiai
ms: Memilih saiz cakera
nb: Velger diskstørrelse
nl: Schijfgrootte kiezen
pl: Wybieranie rozmiaru dysków
pt: A escolher tamanho dos discos
ru: Выбор размера диска
sk: Volia sa veľkosti disku
sq: Duke zgjedhur përmasat e disqeve
th: กำลังเลือกขนาดดิสก์
ur: ڈسک کا حجم منتخب کرتے ہوئے
zh_cn: 选择磁盘大小
zh_tw: 正在選擇磁碟大小

source: Creating a preseed file
ar: ينشئ ملف قبل البذر
ast: Creando un ficheru «preseed»
bg: Създаване на предварителен файл
ca: S'està creant un fitxer de preinstal·lació
cs: Tvorba souboru preseed
de: Vorbelegungsdatei wird erstellt
fi: Luodaan preseed-tiedostoa
gl: Creación dun ficheiro de preinstalación predefininda
he: יצירת קובץ preseed
hr: Stvaranje preseed datoteke
hu: Preseed fájl létrehozása
id: Membuat berkas preseed
it: Creazione di un file di preseed
lt: Kuriamas preseed failas
ms: Menghasilkan fail preseed
nb: Oppretter en preseed fil
nl: Preseed-bestand aanmaken
pl: Tworzenie pliku preseed
pt: A criar o ficheiro preseed
ru: Создание файла автоматизации установки
sk: Vytvára sa preseed súbor
sq: Duke krijuar një skedar të ngjeshur
th: กำลังสร้างแฟ้ม preseed
ur: پریسیڈ فائلیں‌ بناتے ہوئے
zh_cn: 创建一个 preseed 预处理文件
zh_tw: 正在建立 preseed 檔案

source: Adding a new bootloader entry
ar: يضيف مدخلة محمل إقلاع جديدة
ast: Amestando una entrada nueva nel arrancador
bg: Добавяне на нов запис в програмата за начално зареждане
ca: S'està afegint una entrada nova de carregador d'arrencada
cs: Přidává se nová položka do zavaděče
de: Neuer Bootloader-Eintrag wird hinzugefügt
fi: Lisätään uutta käynnistyslataimen kohtaa
gl: Adición dunha nova entrada no cargador de inicio
he: הוספת רשומת איתחול חדשה
hr: Dodavanje nove bootloader stavke
hu: Új rendszerbetöltő-bejegyzés hozzáadása
id: Menambahkan masukan bootloader baru
it: Aggiunta di una nuova opzione di avvio
lt: Pridedamas naujas paleidyklės įrašas
ms: Menambah entri pemuat boot baru
nb: Legger til en ny oppføring i oppstartslaster
nl: Vermelding in opstartlader aanmaken
pl: Dodawanie nowego wpisu programu uruchomieniowego
pt: A adicionar um novo registo no bootloader
ru: Добавление нового элемента в загрузчик
sk: Pridáva sa nová položka do zavádzača
sq: Duke krijuar një hyrje të re të bootloader
th: กำลังเพิ่มรายการบูตโหลดเดอร์ใหม่
ur: ایک نئی بوٹلوڈر انٹری شامل کرتے ہوئے
zh_cn: 添加一个引导项
zh_tw: 正在加入新的開機載入程式條目

source: Setting up installation boot menu
ar: ينشئ قائمة إقلاع التثبيت
ast: Configurando'l menú d'arranque de la instalación
bg: Настройване на стартиращо меню на инсталацията
ca: S'està configurant el menú d'arrencada de la instal·lació
cs: Nastavování zaváděcí nabídky instalace
de: Installations-Bootmenü wird erstellt
fi: Asetetaan asennuksen käynnistysvalikkoa
gl: Configuración do menú de inicio de instalación
he: הגדרת תפריט האיתחול של ההתקנה מתבצעת
hr: Postavljanje instalacijskog boot izbornika
hu: Telepítő rendszerindító menü beállítása
id: Menyiapkan menu boot instalasi
it: Impostazione del menu di avvio
lt: Įdiegiamas diegimo paleidimo meniu
ms: Membuat Seting pemasangan boot menu
nb: Setter opp installasjons oppstartsmeny
nl: Installatie-opstartmenu opzetten
pt: A configurar o menu de arranque da instalação
ru: Настройка загрузочного меню
sk: Nastavuje sa inštalačná ponuka zavádzača
sq: Duke instaluar menunë e ndezjes
th: กำลังตั้งค่าบูตเมนู
ur: انسٹالیشن بوٹ مینیو کو ترتیب دیتے ہوئے
zh_cn: 设置安装启动菜单
zh_tw: 正在設置安裝用開機選單

source: Creating the virtual disks
ar: ينشئ الاقراص الافتراضية
ast: Creando los discos virtuales
bg: Създаване на виртуалните дискове
ca: S'estan creant els discos virtuals
cs: Tvorba virtuálních disků
de: Virtuelle Festplatte wird erstellt
fi: Luodaan virtuaalilevyjä
gl: Creación dos discos virtuais
he: יצירת הכוננים הווירטואליים מתבצעת
hr: Stvaranje virtualnih diskova
hu: A virtuális lemezek létrehozása
id: Membuat disk virtual
it: Creazione dei dischi virtuali
lt: Kuriami virtualūs diskai
ms: Menghasilkan cakera maya
nb: Oppretter virtuelle disker
nl: Virtuele schijven aanmaken
pl: Tworzenie dysków wirtualnych
pt: A criar os discos virtuais
ru: Создание виртуальных дисков
sk: Vytvárajú sa virtuálne disky
sq: Duke krijuar disqet virtuale
th: กำลังสร้างดิสก์เสมือน
ur: مجازی ڈسک کی تشکیل دیتے ہوئے
zh_cn: 创建虚拟磁盘
zh_tw: 正在建立虛擬磁碟

source: Ejecting the CD
ar: يخرج الاسطوانة
ast: Sacando'l CD
bg: Изваждане на диск
ca: S'està expulsant el CD
cs: Vysunování CD
de: CD wird ausgeworfen
fi: Poistetaan levyä asemasta
gl: Expulsión do CD
he: חילוץ התקליטור מתבצע
hr: Izbacivanje CD-a
hu: CD-tálca kiadása
id: Mengeluarkan CD
it: Espulsione del CD
lt: Išstumiamas CD
ms: Mengeluarkan CD
nb: Løser ut CD
nl: Cd uitwerpen
pl: Wysuwanie płyty CD
pt: A ejectar o CD
ru: Извлечение CD
sk: Vysúva sa CD
sq: Duke nxjerrë CD-në
th: กำลังคายซีดี
ur: سی ڈی کا اخراج کریں
zh_cn: 弹出 CD
zh_tw: 正在退出 CD

source: Installing %(distro)s-%(version)s
ar: يثبت %(distro)s-%(version)s
ast: Instalando %(distro)s-%(version)s
bg: Инсталиране на %(distro)s-%(version)s
ca: S'està instal·lant %(distro)s-%(version)s
cs: Probíhá instalace %(distro)s-%(version)s
de: %(distro)s-%(version)s wird installiert
fi: Asennetaan %(distro)s-%(version)s
gl: Instalando %(distro)s-%(version)s
he: מתבצעת התקנת %(distro)s-%(version)s
hr: Instalacija %(distro)s-%(version)s
hu: %(distro)s-%(version)s telepítése
id: Menginstal %(distro)s-%(version)s
it: Installazione di %(distro)s-%(version)s
lt: Diegiama %(distro)s-%(version)s
ms: Memasang %(distro)s-%(version)s
nb: Innstallerer %(distro)s-%(version)s
nl: %(distro)s-%(version)s installeren
pl: Instalowanie %(distro)s-%(version)s
pt: A instalar %(distro)s-%(version)s
ru: Установка %(distro)s-%(version)s
sk: Inštaľuje sa %(distro)s-%(version)s
sq: Duke instaluar %(distro)s-%(version)s
th: กำลังติดตั้ง %(distro)s-%(version)s
ur: تنصیب %(distro)s-%(version)s
zh_cn: 正在安装 %(distro)s %(version)s
zh_tw: 正在安裝 %(distro)s-%(version)s

source: Extracting CD content
ar: يستخرج محتوى الاسطوانة
ast: Estrayendo conteníu del CD
bg: Извличане на съдържание от диска
ca: S'està extraient el contingut del CD
cs: Rozbalování obsahu CD
de: Inhalt der CD wird extrahiert
fi: Puretaan levyn sisältöä
gl: Extracción do contido do CD
he: מתבצע חילוץ תוכן התקליטור
hr: Raspakiravanje sadržaja CD-a
hu: CD tartalmának kibontása
id: Mengekstrak konten CD
it: Estrazione del contenuto del CD
lt: Išskleidžiamas CD turinys
ms: Mengekstrak kandungan CD
nb: Henter innhold fra CD
nl: Cd-inhoud uitpakken
pl: Rozpakowywanie zawartości płyty CD
pt: A extrair o conteúdo do cd
ru: Извлечение содержимого CD
sk: Rozbaľuje sa obsah CD
sq: Duke nxjerrë përmbajtjen e diskut
th: กำลังแตกย่อยเนื้อหาในซีดี
ur: سی ڈی کے مواد کو کشید کرتے ہوئے
zh_cn: 展开 CD 内文件
zh_tw: 正在抽出 CD 內容

source: Installing CD boot helper
ar: يثبت مساعد إقلاع الاسطوانات
ast: Instalando l'asistente de l'arrancador de CD
bg: Инсталиране на CD помощник за стартиране
ca: S'està instal·lant l'auxiliar d'arrencada del CD
cs: Instalace pomocníka pro zavádění z CD
de: CD-Boothelfer wird installiert
fi: Asennetaan CD-levyltä käynnistymisen aputyökalua
gl: Instalación da axuda de inicio do CD
he: התקנת מסייע איתחול התקליטור מתבצעת
hr: Instalacija CD boot pomoćnika
hu: CD-indítási segéd telepítése
id: Menginstal CD boot helper
it: Installazione dell'helper di avvio da CD
lt: Įdiegiamas CD paleidimo pagelbiklis
ms: Memasang pembantu Boot CD
nb: Innstallerer hjelper til oppstartsCD
nl: Cd-opstarthelper installeren
pt: A instalar o assistente de arranque pelo CD
ru: Установка помощника CD-загрузки
sk: Inštaluje sa pomocník zavádzača CD
sq: Duke instaluar ndihmën për nisje
th: กำลังติดตั้งตัวช่วยบูตซีดี
ur: سی ڈی بوٹ مددگار کی تنصیب
zh_cn: 安装光盘磁盘帮助工具
zh_tw: 正在安裝 CD 開機幫助程式

source: Rebooting
ar: يعيد التشغيل
ast: Reaniciando
bg: Рестартиране
ca: S'està reiniciant
cs: Restartování
de: Neustart wird ausgeführt
fi: Käynnistetään uudelleen
gl: Reiniciando
he: מתבצעת הפעלה מחדש
hr: Ponovno pokretanje
hu: Újraindítás
id: Sedang Reboot
it: Riavvio
lt: Iš naujo įkeliama OS
ms: Mulakan kembali sistem
nb: Starter på nytt
nl: Herstarten
pl: Ponowne uruchamianie
pt: A reiniciar
ru: Перезагрузка
sk: Prebieha reštart
sq: Duke rinisur
th: กำลังเริ่มใหม่
ur: دوبارہ چلاتے ہوئے
zh_cn: 正在重启
zh_tw: 正在重新開機

source: Backup ISO
ar: احفظ نسخة أيزو احتياطية
ast: ISO de copia de seguridá
bg: ISO резервно копие
ca: Còpia de seguretat en ISO
cs: Zálohovat ISO
de: Datensicherungs-ISO
fi: Varmuuskopiointilevykuva
gl: Copia de seguranza ISO
he: ISO לגיבוי
hr: Sigurnosna kopija ISO slike
hu: ISO biztonsági mentése
id: Salin ISO
it: Copia ISO
lt: Atsarginės kopijos ISO
ms: Sandaran ISO
nb: Sikkerhetskopi ISO
pl: Zapasowy obraz płyty
pt: Cópia de segurança ISO
ru: Резервный ISO
sk: Zálohovať ISO
sq: ISO mbështetëse
th: สำรอง ISO
ur: آئی ایس او کی بیک اپ بنانا
zh_cn: 备份 ISO 光盘镜像文件
zh_tw: 備份 ISO

source: Remove bootloader entry
ar: أزل مدخلة محمل الإقلاع
ast: Desaniciar entrada de l'arrancador
bg: Премахване на записа от програмата за стартиране
ca: Suprimeix l'entrada del carregador d'arrencada
cs: Odstranit položku zavaděče
de: Bootloader-Eintrag wird entfernt
fi: Poistetaan käynnistylataimen kohtaa
gl: Eliminar a entrada no cargador de inicio
he: הסרת הרשומה מטוען האיתחול
hr: Ukloni bootloader stavku
hu: Rendszerindító bejegyzés törlése
id: Hapus entri bootloader
it: Rimozione voce dal gestore di avvio
lt: Šalinamas paleidyklės įrašas
ms: Keluarkan Kemasukkan Pemuatbut
nb: Fjern oppføring i oppstartslaster
nl: Opstartladervermelding verwijderen
pl: Usuwanie wpisu programu uruchomieniowego
pt: Remover entrada do gestor de arranque
ru: Удалить загрузочную запись
sk: Odstrániť položku v zavádzači
sq: Hiqe hyrjen e bootloader
th: ถอดถอนรายการบูตโหลดเดอร์
ur: بوٹ لوڈر انٹری کو ختم کیا جائے
zh_cn: 删除引导项
zh_tw: 移除開機載入程式條目

source: Remove target dir
ar: أزل الدليل الهدف
ast: Desaniciar el direutoriu destín
bg: Премахване на целева папка
ca: Suprimeix el directori de destinació
cs: Odstranit cílovou složku
de: Zielordner wird entfernt
fi: Poistetaan kohdehakemistoa
gl: Eliminar o cartafol de destino
he: הסרת תיקיית היעד
hr: Ukloni ciljni direktorij
hu: Célkönyvtár eltávolítása
id: Hapus direktori tujuan
it: Rimozione della directory di destinazione
lt: Šalinamas paskirties katalogas
ms: Keluarkan Direktori Tujuan
nb: Fjern destinasjonskatalog
nl: Doelmap verwijderen
pl: Usuwanie katalogu docelowego
pt: Remover directório de destino
ru: Удалить каталог назначения
sk: Odstrániť cieľový adresár
sq: Hiqe direktorinë shënjestër
th: ถอดถอนไดเรกทอรีเป้าหมาย
ur: ٹارگٹ ڈائریکٹری کو ختم کیا جائے
zh_cn: 删除目标目录
zh_tw: 移除目標目錄

source: Remove registry key
ar: أزل مفتاح المضبطة
ast: Desaniciar clave del rexistru
bg: Премахване на ключ от системния регистър
ca: Suprimeix la clau del registre
cs: Odstranit klíče registru
de: Registrierungsschlüssel wird entfernt
fi: Poistetaan rekisteriavainta
gl: Eliminar a chave do rexistro
he: הסרת המפתח ברישומי המערכת
hr: Ukloni ključ registra
hu: Rendszerleíró kulcs eltávolítása
id: Hapus kunci registy
it: Rimozione della chiave di registro
lt: Šalinamas registro raktas
ms: Mengeluarkan kekunci registri
nb: Fjerner registeroppføring
nl: Registersleutel verwijderen
pl: Usuwanie wpisów rejestru
pt: Remover chave do registro
ru: Удалить ключ реестра
sk: Odstrániť kľúč registrov
sq: Hiqe çelësin e regjistrit
th: ถอดถอนกุญแจรีจิสทรี
ur: رجسٹری کوڈ کو ختم کریں
zh_cn: 删除注册表键值
zh_tw: 移除註冊碼

source: Uninstalling %s
ar: يزيل %s
ast: Desinstalando %s
bg: Деинсталиране на %s
ca: S'està desinstal·lant %s
cs: Odstraňování %s
de: %s wird deinstalliert
fi: Poistetaan asennusta: %s
gl: Desinstalando %s
he: הסרת %s מתבצעת
hr: Uklanjanje %s
hu: %s eltávolítása
id: Membongkar %s
it: Rimozione di %s
lt: Šalinama %s
ms: Nyahpasang %s
nb: Avinstallerer %s
nl: %s verwijderen
pl: Odinstalowywanie %s
pt: A desinstalar %s
ru: Удаление %s
sk: Odinštalováva sa %s
sq: Duke çinstaluar %s
th: กำลังถอดถอน %s
ur: ناتنصیب %s
zh_cn: 正在卸载 %s
zh_tw: 正在解除安裝 %s

source: Checking CD %s
ar: يفحص الاسطوانة %s
ast: Comprobando'l CD %s
bg: Проверка на диск %s
ca: S'està comprovant el CD %s
cs: Kontrola CD %s
de: CD %s wird überprüft
fi: Tarkistetaan CD: %s
gl: Comprobando o CD %s
he: בדיקת התקליטור %s
hr: Provjera CD-a: %s
hu: %s CD ellenőrzése
id: Memeriksa CD %s
it: Controllo CD in %s
lt: Tikrinamas CD %s
ms: Memeriksa CD %s
nb: Sjekker CD %s
nl: Cd %s controleren
pl: Sprawdzanie płyty CD %s
pt: A verificar o CD %s
ru: Проверка CD %s
sk: Kontroluje sa CD %s
sq: Duke kontrolluar CD %s
th: กำลังตรวจสอบซีดี %s
ur: سی ڈی کی جانچ %s
zh_cn: 正在检查光盘 %s
zh_tw: 正在檢查 CD %s
