Repository: hakuna-m/wubiuefi
Catalog: po/*.po
Languages: ar, ast, bg, ca, cs, de, fi, gl, he, hr, hu, id, it, lt, ms, nb, nl, pl, pt, ru, sk, sq, th, ur, zh_cn, zh_tw

source: Downloading information on installation files
ar: ينزل معلومات عن ملفات التثبيت
ast: Descargando información de ficheros d'instalación
bg: Изтегляне на информация за инсталационните файлове
ca: S'està baixant informació sobre els fitxers d'instal·lació
cs: Stahování informací o instalačních souborech
de: Informationen über die Installationsdateien werden heruntergeladen
fi: Noudetaan tietoja asennustiedostoista
gl: Descarga de información nos ficheiros de instalación
he: מתבצעת הורדת מידע אודות קובצי ההתקנה
hr: Preuzimanje informacija o instalacijskim datotekama
hu: Telepítőfájlok információinak letöltése
id: Mengunduh informasi pada berkas instalasi
it: Scaricamento informazioni sui file di installazione
lt: Parsiunčiama diegimo failų informacija
ms: Memuat turun maklumat pada fail pemasangan
nb: Laster ned informasjon om innstallasjonsfiler
nl: Informatie over installatiebestanden downloaden
pl: Pobieranie informacji o plikach instalacyjnych
pt: A descarregar informação dos ficheiros de instalação
ru: Загрузка информации по файлам установки
sk: Sťahujú sa informácie o inštalačných súboroch
sq: Duke shkarkuar informacionin rreth skedarëve të instalimit
th: กำลังดาวน์โหลดข้อมูลจากแฟ้มติดตั้ง
ur: تنصیب فائلوں‌ کی معلومات ڈاؤن لوڈ کی جا رہی ہے
zh_cn: 正在下载安装文件信息
zh_tw: 正在下載安裝檔案上的資訊

source: Checking installation files
ar: يفحص ملفات التثبيت
ast: Comprobando ficheros d'instalación
bg: Проверка на инсталационните файлове
ca: S'estan comprovant els fitxers d'instal·lació
cs: Kontrola instalačních souborů
de: Installationsdateien werden überprüft
fi: Tarkistetaan asennustiedostoja
gl: Comprobación dos ficheiros de instalación
he: מתבצעת בדיקת קובצי ההתקנה
hr: Provjera instalacijskih datoteka
hu: Telepítőfájlok ellenőrzése
id: Memeriksa berkas instalasi
it: Controllo file di installazione
lt: Tikrinami diegimo failai
ms: Memeriksa fail pemasangan
nb: Sjekker installasjonfiler
nl: Installatiebestanden controleren
pl: Sprawdzanie plików instalacyjnych
pt: A verificar os ficheiros de instalação
ru: Проверка файлов установки
sk: Kontrolujú sa inštalačné súbory
sq: Duke kontrolluar skedarët e instalimit
th: กำลังตรวจสอบแฟ้มติดตั้ง
ur: تنصیب فائلوں کی جانچ پڑتال
zh_cn: 检查安装文件
zh_tw: 正在檢查安裝檔案

source: Validating %s
ar: يتحقق من صحة %s
ast: Validando %s
bg: Проверка на %s
ca: S'està validant %s
cs: Ověřování %s
de: %s wird überprüft
fi: Tarkistetaan: %s
gl: Validando %s
he: מתבצע אימות %s
hr: Provjera %s
hu: %s ellenőrzése
id: Memvalidasi %s
it: Convalida di %s
lt: Tikrinama %s
ms: Mengesahkan %s
nb: Validerer %s
nl: %s valideren
pt: A validar %s
ru: Проверка %s
sk: Overuje sa %s
sq: Duke vlerësuar %s
th: กำลังตรวจสอบความถูกต้อง %s
ur: جانچنا %s
zh_cn: 正在校验 %s
zh_tw: 正在驗證 %s

source: Extracting files from %s
ar: يستخرج ملفات من %s
ast: Estrayendo ficheros de %s
bg: Извличане на файлове от %s
ca: S'estan extraient els fitxers de %s
cs: Rozbalování souborů z %s
de: Datein aus %s werden extrahiert
fi: Puretaan tiedostoja: %s
gl: Extracción de ficheiros de %s
he: מתבצע חילוץ קבצים מ־%s
hr: Raspakiravanje datoteka iz %s
hu: Fájlok kibontása ebből: %s
id: Mengekstrak berkas dari %s
it: Estrazione file da %s
lt: Išskleidžiami failai iš %s
ms: Mengekstrak fail dari %s
nb: Pakker ut filer fra %s
nl: Bestanden uit %s uitpakken
pl: Rozpakowywanie plików z %s
pt: A extrair ficheiros de %s
ru: Извлечение файлов из %s
sk: Rozbaľujú sa súbory z %s
sq: Duke ekstraktuar skedarët nga %s
th: กำลังแตกย่อยแฟ้มจาก %s
ur: %s سے فائلیں کشید کرنا
zh_cn: 从 %s 展开文件
zh_tw: 正在從 %s 抽出檔案

source: Checking %s
ar: يفحص %s
ast: Comprobando %s
bg: Проверка на %s
ca: S'està comprovant %s
cs: Kontrola %s
de: %s wird überprüft
fi: Tarkistetaan %s
gl: Comprobando %s
he: מתבצעת בדיקת %s
hr: Provjera %s
hu: %s ellenőrzése
id: Menyalin berkas dari CD %s
it: Controllo di %s
lt: Tikrinama %s
ms: Memeriksa %s
nb: Sjekker %s
nl: %s controleren
pl: Sprawdzanie %s
pt: A verificar %s
ru: Проверка %s
sk: Kontroluje sa %s
sq: Duke kontrolluar %s
th: กำลังตรวจสอบ %s
ur: %s کی جانچ پڑتال
zh_cn: 正在检查 %s
zh_tw: 正在檢查 %s

source: Are you sure you want to quit?
ar: أمتأكد أنك تريد الخروج؟
ast: ¿De xuro que quies colar?
bg: Сигурни ли сте, че искате да затворите програмата?
ca: Esteu segur que voleu sortir?
cs: Opravdu chcete skončit?
de: Wollen Sie das Programm wirklich beenden?
fi: Haluatko varmasti poistua?
gl: Está seguro de que quere saír?
he: האם ברצונך לצאת?
hr: Jeste li sigurni da želite odustati?
hu: Biztos, hogy ki szeretne lépni?
id: Apakah Anda yakin ingin keluar?
it: Terminare veramente?
lt: Ar tikrai norite baigti?
ms: Anda pasti untuk keluar?
nb: Er du sikker på at du vil avslutte?
nl: Weet u zeker dat u wilt stoppen?
pl: Zakończyć działanie programu?
pt: Tem a certeza de que deseja sair?
ru: Вы уверены, что хотите выйти?
sk: Naozaj chcete skončiť?
sq: Jeni i sigurt se doni të dilni?
th: คุณแน่ใจหรือไม่ที่จะออก?
ur: کيا آپ واقعي چھوڑ نا چاہ رہیے ہیں؟
zh_cn: 您确定要退出吗？
zh_tw: 您確定要退出嗎？

source: Finish
ar: أنهِ
ast: Finar
bg: Край
ca: Finalitza
cs: Dokončit
de: Beenden
fi: Valmis
gl: Concluír
he: סיום
hr: Završi
hu: Befejezés
id: Selesai
it: Finito
lt: Pabaiga
ms: Tamat
nb: Avslutt
nl: Voltooien
pl: Zakończ
pt: Terminar
ru: Закончить
sk: Dokončiť
sq: Përfundo
th: เสร็จ
ur: ختم
zh_cn: 完成
zh_tw: 完成

source: Uninstallation completed
ar: اكتملت عملية الإزالة
ast: Desinstalación completada
bg: Деинсталирането завърши
ca: S'ha completat la desinstal·lació
cs: Odinstalace dokončena
de: Deinstallation abgeschlossen
fi: Asennuksen poisto valmis
gl: Desinstalación completada
he: ההסרה הושלמה
hr: Uklanjanje završeno
hu: Eltávolítás befejeződött
id: Proses penghapusan selesai
it: Rimozione completata
lt: Šalinimas baigtas
ms: Nyahpasang selesai
nb: Avinstallasjon fullført
nl: Verwijdering compleet
pl: Odinstalowywanie zakończone
pt: Desinstalação completa
ru: Удаление завершено
sk: Odinštalácia dokončená
sq: Çinstalimi u kompletua
th: การถอดถอนสมบูรณ์
ur: غیر تنصیب مکمل
zh_cn: 卸载完毕
zh_tw: 解除安裝已完成

source: %s has been successfully uninstalled
ar: تمت إزالة %s بنجاح
ast: %s desinstalose correcho
bg: %s беше деинсталиран успешно
ca: S'ha desinstal·lat %s amb èxit
cs: %s bylo úspěšně odinstalováno
de: %s wurde erfolgreich deinstalliert
fi: %s on poistettu onnistuneesti
gl: %s desinstalouse correctamente
he: הסרת %s הושלמה בהצלחה
hr: %s je uspješno uklonjen
hu: %s sikeresen eltávolítva.
id: %s telah berhasil dihapus
it: %s è stato rimosso con successo
lt: %s buvo sėkmingai pašalinta
ms: %s telah dinyahpasang
nb: %s er blitt avinnstallert suksessfullt
nl: %s is succesvol verwijderd
pl: %s zostało odinstalowane poprawnie
pt: %s foi desinstalado com sucesso
ru: %s был успешно удалён
sk: %s bol úspešne odinštalovaný
sq: %s u çinstalua me sukses
th: %s ถูกถอดถอนสำเร็จ
ur: %s کی کامیابی سے غیر تنصیب ہو چکی
zh_cn: %s 已经成功卸载
zh_tw: %s 已經成功解除安裝

source: %s Uninstaller
ar: مُزيل %s
ast: Desinstalador %s
bg: Деинсталатор на %s
ca: Desinstal·lador %s
cs: Odstranění %s
de: %s-Deinstallationsprogramm
fi: %s - asennuksen poisto
gl: %s Desinstalador
he: תכנית הסרת %s
hu: %s eltávolító
id: Uninstaller %s
it: Programma di rimozione di %s
lt: %s šalinimo programa
ms: Nyahpasang %s
nb: %s Avinnstaller
nl: Verwijdering van %s
pl: Program odinstalowujący %s
pt: Desinstalador de %s
ru: Программа удаления %s
sk: %s Odinštalátor
sq: Çinstaluesi i %s
th: ตัวถอดถอน %s
ur: %s تنصیبی
zh_cn: %s 卸载程序
zh_tw: %s 解除安裝程式

source: Uninstallation required
ar: الإزالة مطلوبة
ast: Requierse desinstalar
bg: Необходимо е деинсталиране
ca: Cal fer una desinstal·lació
cs: Je vyžadována odinstalace
de: Deinstallation notwendig
fi: Asennuksen poisto vaaditaan
gl: Requírese a desinstalación
he: נדרשת הסרה
hr: Potrebno uklanjanje
hu: Eltávolítás szükséges
id: Diperlukan pembongkaran
it: Richiesta la rimozione
lt: Reikalingas pašalinimas
ms: Nyahpasang diperlukan
nb: Avinstallasjon kreves
nl: Verwijdering vereist
pl: Wymagane odinstalowanie
pt: Desinstalação necessária
ru: Требуется удаление
sk: Odinštalácia požadovaná
sq: Kërkohet çinstalimi
th: จำเป็นต้องถอดถอน
ur: غیر تنصیب کی ضرورت
zh_cn: 需要卸载
zh_tw: 需要解除安裝

source: You are about to uninstall %s
ar: أنت على وشك إزالة %s
ast: Tas a piques de desinstalar %s
bg: Ще деинсталирате %s
ca: Esteu a punt de desinstal·lar %s
cs: Chystáte se odinstalovat %s
de: Sie sind dabei, %s zu deinstallieren
fi: Olet poistamassa asennusta: %s
gl: Está a piques de desinstalar %s
he: הסרת %s עומדת להתבצע
hr: Upravo ćete ukloniti %s
hu: A(z) %s eltávolítására készül
id: Anda akan membongkar %s
it: Si sta per rimuovere %s
lt: Jūs tuoj pašalinsite %s
ms: Anda akan mengeluarkan %s
nb: Du er i ferd med å avinnstallere %s
nl: U staat op het punt om %s te verwijderen
pl: Nastąpi odinstalowanie %s
pt: %s vai ser desinstalado
ru: Вы собираетесь удалить %s
sk: Práve idete odinštalovať %s
sq: Jeni gati për të çinstaluar %s
th: คุณมีความต้องการถอดถอน %s
ur: آپ %s کو ان انسٹال کرنے جا رہے ہیں
zh_cn: 您正要卸载 %s
zh_tw: 您將要解除安裝 %s

source: Uninstall
ar: أزل
ast: Desinstalar
bg: Деинсталиране
ca: Desinstal·la
cs: Odinstalovat
de: Deinstallieren
fi: Poista asennus
gl: Desinstalar
he: הסרה
hr: Ukloni
hu: Eltávolítás
id: Bongkar
it: Rimuovi
lt: Pašalinti
ms: Nyahpasang
nb: Avinstallere
nl: Verwijderen
pl: Odinstalowanie
pt: Desinstalar
ru: Удалить
sk: Odinštalovať
sq: Çinstalo
th: ถอดถอน
ur: غیر تنصیب
zh_cn: 卸载
zh_tw: 解除安裝

source: Cancel
ar: ألغِ
ast: Encaboxar
bg: Отказ
ca: Cancel·la
cs: Zrušit
de: Abbrechen
fi: Peru
gl: Cancelar
he: ביטול
hr: Odustani
hu: Mégse
id: Batal
it: Annulla
lt: Atsisakyti
ms: Batal
nb: Avbryt
nl: Annuleren
pl: Anuluj
pt: Cancelar
ru: Отмена
sk: Zrušiť
sq: Anullo
th: ยกเลิก
ur: منسوخ
zh_cn: 取消
zh_tw: 取消

source: A previous installation was detected, it needs to be uninstalled before continuing
ar: وُجِد تثبيت سابق. تحتاج إلى إزالته قبل المتابعة.
ast: Deteutose una instalación previa, hai que la desinstalar enantes de siguir
bg: Беше открита предишна инсталация. Трябва да се деинсталира преди да продължите
ca: S'ha detectat una instal·lació prèvia, la qual s'ha de desinstal·lar abans de continuar
cs: Byla nalezena předchozí instalace, pro pokračování je nutné tuto předchozí verzi odinstalovat
de: Eine vorherige Installation wurde gefunden, welche zunächst deinstalliert werden muss, bevor fortgefahren werden kann
fi: Edellinen asennus havaittiin, ja se tulee poistaa ennen jatkamista
gl: Detectouse unha instalación previa, é preciso que se desinstale esa antes de continuar
he: אותרה התקנה קודמת, יש צורך בהסרתה בטרם המעבר הלאה
hr: Pronađena je prethodna instalacije. Prije nastavka je potrebno njezino uklanjanje
hu: Egy régebbi telepítés észlelhető, ezért a folytatás előtt el kell azt távolítani
id: Pemasangan sebelumnya terdeteksi, ini perlu dibongkar sebelum melanjutkan
it: È stata rilevata un'installazione precedente, è necessario rimuoverla prima di continuare
lt: Aptiktas ankstesnis diegimas, prieš tęsiant jis turi būti pašalintas
ms: Pemasangan lepas telah dikenalpasti, ia perlu dikeluarkan sebelum anda dapat teruskan
nb: En tidligere installasjon ble oppdaget. Den må avinstalleres før du kan fortsette
nl: Er is een oudere versie gedetecteerd. Deze moet verwijderd worden voordat er verder gegaan kan worden.
pl: Wykryto wcześniejszą instalacje systemu. Należy ją usunąć, aby kontynuować.
pt: Foi detectada uma instalação interior, que precisa ser desinstalada antes de continuar
ru: Была обнаружена предыдущая установка, она должна быть удалена перед тем, как продолжить
sk: Bola zistená predchádzajúca inštalácia, ktorú je potrebné odinštalovať pred pokračovaním
sq: U dallua një instalim i mëparshëm, ai duhet çinstaluar para se të vazhdojmë
th: ค้นพบว่ามีการติดตั้งอยู่ก่อน จำเป็นต้องถอดถอนก่อนดำเนินการต่อ
ur: ایک گزشتہ تنصیب کا پتہ چلا، آگے بڑھنے سے پہلے غیر تنصیب کرنے کی ضرورت ہے
zh_cn: 检测到上次的安装，需要先卸载才能继续
zh_tw: 偵測到上一次的安裝，在繼續之前要先將它解除安裝

source: Are you sure you want to uninstall?
ar: أمتأكد من رغبتك في إزالة التثبيت؟
ast: ¿Seguro que quies desinstalar?
bg: Сигурни ли сте, че искате да го деинсталирате?
ca: Esteu segur que voleu fer una desinstal·lació?
cs: Opravdu chcete odinstalovat?
de: Sind Sie sicher, dass Sie mit der Deinstallation fortfahren wollen?
fi: Haluatko varmasti poistaa asennuksen?
gl: Está seguro de que querer desinstalar?
he: האם ברצונך להסיר את ההתקנה?
hr: Jeste li sigurni da želite ukloniti?
hu: Biztosan el akarja távolítani?
id: Anda yakin ingin membongkar?
it: Procedere veramente con la rimozione?
lt: Ar tikrai norite pašalinti?
ms: Adakah anda pasti untuk menyahpasang?
nb: Er du sikkert på at du vil avinstallere?
nl: Weet u zeker dat u wilt verwijderen?
pl: Odinstalować?
pt: Tem a certeza que deseja desinstalar?
ru: Вы уверены, что хотите удалить?
sk: Naozaj chcete odinštalovať?
sq: Jeni i sigurtë që dëshironi ta çinstaloni?
th: คุณแน่ใจหรือไม่ที่จะถอดถอน?
ur: کیا آپ واقعی ان انسٹال کرنا چاہتے ہیں؟
zh_cn: 您确定要卸载吗？
zh_tw: 您確定要解除安裝嗎？

source: Backup the downloaded files (ISO)
ar: احفظ نسخة احتياطية من ملفات أيزو التي تم تنزيلها.
ast: Facer copia de los archivos descargaos (ISO)
bg: Архивиране на изтеглените файлове (ISO)
ca: Fes una còpia de seguretat dels fitxers baixats (ISO)
cs: Zálohovat stažené soubory (ISO)
de: Die heruntergeladenen Dateien (ISO) sichern
fi: Varmuuskopioi noudetut tiedostot (ISO)
gl: Gardar unha copia de seguranza dos ficheiros descargados (ISO)
he: גיבוי הקבצים מההורדה (ISO)
hr: Sigurnosna kopija preuzetih datoteka (ISO)
hu: A letöltött ISO fájlok biztonsági mentése
id: Buat salinan berkas yang telah diunduh (ISO)
it: Copia dei file scaricati (ISO)
lt: Padaryti atsiųstų failų (ISO) atsargines kopijas
ms: Simpan Salinan fail yang dimuat urun (ISO)
nb: Sikkerhetskopier nedlastede filer (ISO)
nl: Een back-up maken van de gedownloade bestanden (ISO)
pl: Zapisz kopię zapasową pobranych plików (ISO)
pt: Criar cópia de segurança dos ficheiros transferidos (ISO)
ru: Резервное копирование загруженных файлов (ISO)
sk: Zálohovať stiahnuté súbory (ISO)
sq: Ruaji skedarët e shkarkuar (ISO)
th: สำรองแฟ้ม (ISO) ที่ดาวน์โหลดแล้ว
ur: ڈاؤن لوڈ فائلوں (آئی ایس او) کا بیک اپ بنایا جائے
zh_cn: 备份已下载的文件(ISO)
zh_tw: 備份下載的檔案 (ISO)

source: Only %sMB of disk space are available. At least 1024MB are required as a bare minimum. Quitting
ar: %sم.بايت متاحة من مساحة القرص فقط. مطلوب 1024م.بايت كحد أدنى. سأغلق
ast: Sólo hai disponibles %sMB d'espaciu de discu. Necesítase un mínimu de polo menos 1024MB. Colando.
bg: Само %sМБ място са свободни. 1024МБ са абсолютния минимум. Затваряне на програмата
ca: Només hi ha %s MB disponibles al disc Calen 1024 MB com a mínim. Es sortirà.
cs: Je dostupných pouze %sMB diskového prostoru. Jako naprosté minimum je vyžadováno alespoň 1024MB. Ukončuje se
de: Es stehen nur %sMB an Festplattenplatz zur Verfügung. Es werden 1024MB als absolutes Minimum benötigt. Programm wird beendet
fi: Vain %sMB levytilaa saatavilla. Vähintään 1024MB vaaditaan ehdottomana alarajana. Poistutaan.
gl: Só están dispoñíbeis %sMB de espazo de disco. Precísase, cando menos 1024MB como mínimo. Saíndo
he: רק %sמ"ב של שטח דיסק פנוי. נדרשים 1024מ"ב לכל הפחות. יוצא
hr: Disk ima samo %s MB raspoloživog prostora. Potrebno je najmanje 1024 MB za nastavak. Instalacija se prekida
hu: Csak %s MB lemezhely érhető el. Legalább 1024 MB szükséges. Kilépés.
id: Hanya tersedia ruang cakram %sMB. Setidaknya dibutuhkan sebesar 1024MB. Keluar
it: Sono disponibili solo %s MiB di spazio su disco. Per un'installazione minima sono necessari almeno 1024 MiB. Uscita dall'installazione.
lt: Yra prieinama tik %s MB laisvos vietos diske. Reikia mažiausiai 1024 MB. Baigiu
ms: Hanya %sMB ruangan cakera yang tinggal. Sekurang-kurangnya paling minima iaitu 1024MB diperlukan. Menamatkan
nb: Bare %sMB diskplass er tilgjengelig. 1024MB er absolutt minimumskrav. Avslutter
nl: Er is maar %sMB vrije schijfruimte beschikbaar. Er is minstens 1024MB nodig. Setup sluit nu af
pl: Pozostało tylko %s MB wolnej przestrzeni dyskowej. Wymagane jest co najmniej 1024 MB, aby kontynuować. Kończenie instalacji.
pt: Apenas %sMB estão livres no disco. São necessários pelo menos 1024MB de espaço para instalação mínima. A sair
ru: Доступно только %sМБ места на диске. Как минимум требуется 1024МБ. Выход
sk: Na disku je voľných len %s MB. Požadované minimum je najmenej 1024 MB. Ukončuje sa
sq: Vetëm %sMB hapësirë është e disponueshme në disk. Kërkohen si minimum të paktën 1024MB. Duke dalë
th: มีพื้นที่ว่างบนดิสก์ %sMB เท่านั้นที่ใช้ได้ ความต้องการขั้นต่ำคือ 1024MB กำลังออก
ur: ڈسک کی جگہ صرف%s ایم بی دستیاب ہیں۔ کم سے کم 1024 ایم بی کی ضرورت ہے بطور کم از کم کے۔ بند کیا جا رہا ہے
zh_cn: 只有 %sMB 可用磁盘空间。 最小安装需要 1024MB 空间。退出
zh_tw: 只有 %sMB 的磁碟空間可用。 最低限度至少需要 1024MB。正在退出

source: %(min_space)sMB of disk size are required for installation. Only %(max_space)sMB are available. The installation may fail in such circumstances. Do you wish to continue anyway?
ar: مطلوب %(min_space)sم.بايت من حجم القرص لعملية التثبيت. %(max_space)sم.بايت متوفرة فقط. في مثل هذه الحالة قد تفشل عملية التثبيت. هل ترغب في المتابعة بالرغم من ذلك؟
ast: Necesitense %(min_space)sMB d'espaciu de discu pa la instalación. Sólo tan disponibles %(max_space)sMB. La instalación seique falle nestes circunstancies. ¿Quies continuar de toles maneres?
bg: %(min_space)sМБ място е необходимо за инсталация. Само %(max_space)sМБ са свободни. Инсталацията може да е неуспешна. Искате ли да продължите въпреки това?
ca: Calen %(min_space)s MB d'espai lliure al disc per a la instal·lació. Només hi ha %(max_space)s MB disponibles. Pot ser que en aquestes circumstàncies falli la instal·lació. Voleu continuar de totes maneres?
cs: %(min_space)sMB diskového prostoru je vyžadováno pro instalaci. Je dostupných pouze %(max_space)sMB. Instalace může v určitých případech selhat. Chcete přesto pokračovat?
de: Es werden mindestens %(min_space)sMB an Festplattenplatz für die Installation benötigt. Es stehen nur %(max_space)sMB zur Verfügung. Die Installation kann unter solchen Umständen fehlschlagen. Wollen Sie trotzdem fortfahren?
fi: %(min_space)sMB levytilaa tarvitaan asennukseen. Vain %(max_space)sMB on saatavilla. Asennus voi epäonnistua. Haluatko kuitenkin jatkaa?
gl: Requírese %(min_space)sMB de espazo de disco para a instalación. Só están dispoñíbeis %(max_space)sMB. A instalación pode fallar en tales circunstancias. Quere continuar de todas maneiras?
he: %(min_space)sמ"ב מנפח הכונן נדרשים עבור ההתקנה. רק %(max_space)sמ"ב זמינים. בנסיבות אלו ההתקנה עלולה להיכשל. האם ברצונך להמשיך בכל מקרה?
hr: Potrebno je najmanje %(min_space)sMB slobodnog prostora na disku za instalaciju. Raspoloživo je samo %(max_space)sMB. U ovakvom slučaju moguće je da instalacija ne uspije. Želite li ipak nastaviti?
hu: %(min_space)s MB lemezhely szükséges a telepítéshez. Csak %(max_space)s MB érhető el. A telepítés ilyen körülmények között meghiúsulhat. Mindenképp folytatja?
id: Dibutuhkan ruang disk %(min_space)sMB untuk instalasi. Hanya %(max_space)sMB yang tersedia. Instalasi mungkin gagal bila keadaannya seperti ini. Apakah Anda ingin tetap melanjutkan?
it: Sono richiesti %(min_space)s MiB di spazio su disco per l'installazione. Solo %(max_space)s MiB sono disponibili. L'installazione potrebbe non riuscire in tali circostanze. Continuare lo stesso?
lt: Diegimui reikia %(min_space)s MB vietos diske. Prieinama tik %(max_space)s MB. Esant tokiai situacijai diegimas gali būti nesėkmingas. Ar vistiek norite tęsti?
ms: %(min_space)sMB ruangan cakera diperlukan untuk pemasangan. hanya %(max_space)sMB yang tinggal. Pemasang akan gagal dalam keadaan tersebut. Adakah anda ingin teruskan?
nb: %(min_space)sMB diskplass er nødvendig for installasjon. Bare %(max_space)sMB er tilgjengelig. Installasjonen kan i slike tilfeller mislykkes. Ønsker du å fortsette likevel?
nl: %(min_space)sMB vrije schijfruimte is benodigd voor de installatie. Er is maar %(max_space)sMB beschikbaar. De installatie kan onder deze omstandigheden mislukken. Wilt u toch doorgaan met de installatie?
pl: Instalacja wymaga %(min_space)s MB wolnej przestrzeni dyskowej. Dostępne jest tylko %(max_space)sMB. Instalacja może nie udać się. Kontynuować?
pt: %(min_space)sMB de espaço em disco são necessários para a instalação. Apenas %(max_space)sMB estão disponíveis. A instalação poderá falhar nestas circunstâncias. Deseja continuar mesmo assim?
ru: Для установки требуется %(min_space)sМБ дискового пространства. Доступно только %(max_space)sМБ. Продолжение может привести к аварийному завершению установки. Вы уверены, что ходите продолжить?
sk: %(min_space)s MB voľného miesta je potrebných na inštaláciu. Voľných je len %(max_space)s MB. Za týchto okolností môže inštalácia zlyhať . Želáte si napriek tomu pokračovať?
th: ต้องการพื้นที่ดิสก์ %(min_space)sMB เพื่อติดตั้ง มีเพียง %(max_space)sMB เท่านั้นที่ใช้ได้ การติดตั้งอาจล้มเหลวในสภาวะเช่นนี้ คุณต้องการดำเนินการต่อไปหรือไม่?
ur: انسٹالیشن کے لیے %(min_space)s ایم بی ڈسک سائز کی ضرورت ہے۔ صرف %(max_space)s ایم بی دستیاب ہیں۔ تنصیب ایسے حالات میں ناکام ہو سکتی ہے۔ کیا آپ اس کو ہر صورت جاری رکھنا چاہتے ہیں؟
zh_cn: 安装需要 %(min_space)sM 的磁盘空间。 但是现在只有 %(max_space)sM 可用磁盘空间。 当前的安装方式下，可能会造成安装失败。 仍然要继续吗？
zh_tw: 需要 %(min_space)sMB 的磁碟空間以安裝。 只有 %(max_space)sMB 可用。 在這樣的情況下很可能安裝失敗。 無論如何您都想要繼續嗎？

source: (%sGB free)
ar: (%sج.بايت مساحة خالية)
ast: (%sGB llibres)
bg: (%sГБ свободни)
ca: (%s GB disponibles)
cs: (%sGB volných)
de: (%sGB frei)
fi: (%sGB vapaana)
gl: (%sGB libre)
he: (%sג"ב פנויים)
hr: (%sGB slobodno)
hu: (%s GB szabad)
id: (%sGB kosong)
it: (%s GiB liberi)
lt: (%s GB laisva)
ms: (%sGB bebas)
nb: (%sGB ledig)
nl: (%sGB vrij)
pl: (%s GB wolnych)
pt: (%sGB livres)
ru: (%sГБ свободно)
sk: (%s GB voľných)
sq: (%sGB të lira)
th: (ว่าง %sGB)
ur: (%sجی بی مفت)
zh_cn: (%sGB 空闲)
zh_tw: (%sGB 可用)

source: Please select username and password for the new account
ar: يرجى اختيار اسم مستخدم و كلمة سر للحساب الجديد
ast: Seleicione un nome d'usuariu y una contraseña pa la nueva cuenta
bg: Моля, изберете потребителско име и парола за новия профил
ca: Trieu el nom d'usuari i la clau d'accés per al compte nou
cs: Prosím zvolte pro nový účet uživatelské jméno a heslo
de: Bitte wählen Sie einen Benutzernamen und ein Passwort für das neue Konto
fi: Valitse uudelle käyttäjätilille käyttäjänimi ja salasana
gl: Por favor, elixa un nome de usuario e un contrasinal para a nova conta
he: יש לבחור שם משתמש וסיסמה לחשבון החדש
hr: Molim odaberite korisničko ime i lozinku za vaš račun
hu: Kérem válasszon felhasználónevet és jelszót az új fiókhoz.
id: Silakan pilih nama pengguna dan sandi untuk akun baru
it: Selezionare nome utente e password per il nuovo account
lt: Nurodykite naujos paskyros naudotojo vardą ir slaptažodį
ms: Sila pilih nama pengguna dan kata laluan untuk akaun baru
nb: Vennligst velg brukernavn og passord for den nye kontoen
nl: Kies een gebruikersnaam en wachtwoord voor de nieuwe gebruikersaccount
pl: Proszę wprowadzić nazwę użytkownika i hasło dla nowego konta.
pt: Por favor selecione o nome de utilizador e a senha para a nova conta
ru: Пожалуйста, выберите имя пользователя и пароль для новой учетной записи
sk: Prosím, zvolte si používateľské meno a heslo pre nový účet
sq: Ju lutem zgjidhni emrin e përdoruesit dhe fjalëkalimin për llogarinë e re
th: โปรดเลือกชื่อผู้ใช้และรหัสผ่าน สำหรับบัญชีผู้ใช้ใหม่
ur: برائے مہربانی نئے اکاؤنٹ کے لیے یوزر کا نام اور پاسورڈ منتخب کریں
zh_cn: 请为新帐户选择用户名称和密码
zh_tw: 請為新帳號輸入用戶名和密碼

source: Accessibility
ar: الإتاحة
ast: Accesibilidá
bg: Достъпност
ca: Accessibilitat
cs: Přístupnost
de: Barrierefreiheit
fi: Esteettömyys
gl: Accesibilidade
he: נגישות
hr: Pristupačnost
hu: Akadálymentesítés
id: Aksesibilitas
it: Accessibilità
lt: Pritaikymas neįgaliesiems
ms: Kebolehdapatan
nb: Tilgjengelighet
nl: Toegankelijkheid
pl: Ułatwienia dostępu
pt: Acessibilidade
ru: Доступность
sk: Prístupnosť
sq: Përdorshmëria
th: สิ่งอำนวยความสะดวก
ur: معذور رسائی
zh_cn: 辅助功能
zh_tw: 輔助功能
