/*
 *  GRUB Utilities --  Utilities for GRUB Legacy, GRUB2 and GRUB for DOS
 *  Copyright (C) 2009  Bean (bean123ch@gmail.com)
 *
 *  This program is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <string.h>
#include <assert.h>
#include <fcntl.h>
#include <sys/stat.h>
#include <time.h>

#include "xdio.h"
#include "keytab.h"

#include "version.h"
#include "fbinst.h"
#include "fb_mbr_rel.h"
#include "fb_mbr_dbg.h"

#ifdef WIN32
#include <windows.h>
#endif

#define BUILD_NUMBER		1

char *progname = "fbinst";
int verbosity = 0;
char *fb_mbr_data = fb_mbr_rel;

#define DEF_FAT32_SIZE		512 * 2048
#define MIN_FAT16_SIZE		8400 + 1

#define DEF_BASE_SIZE		63
#define DEF_LIST_SIZE		1024
#define DEF_PRI_SIZE		63 * 256

#define GLOB_BUF_SIZE		64

#define uchar	unsigned char
#define uchar2	unsigned short
#define uchar4	unsigned long

#ifdef __GNUC__
#define PACK	__attribute__((packed))
#else
#define PACK
#pragma pack(1)
#endif

struct fb_mbr
{
  uchar jmp_code;
  uchar jmp_ofs;
  uchar boot_code[0x1a9];
  uchar max_sec;		/* 0x1ab  */
  uchar2 lba;			/* 0x1ac  */
  uchar spt;			/* 0x1ae  */
  uchar heads;			/* 0x1af  */
  uchar2 boot_base;		/* 0x1b0  */
  uchar2 boot_size;		/* 0x1b2  */
  uchar4 fb_magic;		/* 0x1b4  */
  uchar mbr_table[0x46];	/* 0x1b8  */
  uchar2 end_magic;		/* 0x1fe  */
} PACK;

struct fb_data
{
  uchar2 menu_ofs;		/* 0x200  */
  uchar2 flags;			/* 0x202  */
  uchar ver_major;		/* 0x204  */
  uchar ver_minor;		/* 0x205  */
  uchar4 pri_size;		/* 0x206  */
  uchar4 ext_size;		/* 0x20a  */
} PACK;

struct fb_ar_data
{
  uchar4 ar_magic;		/* 0x200  */
  uchar ver_major;		/* 0x204  */
  uchar ver_minor;		/* 0x205  */
  uchar4 pri_size;		/* 0x206  */
  uchar4 ext_size;		/* 0x20a  */
  uchar4 boot_size;		/* 0x20e  */
} PACK;

struct fat_bs16
{
  uchar jb[3];		/* Jump boot  */
  char on[8];		/* Oem name  */
  uchar2 bps;		/* Bytes per sector  */
  uchar spc;		/* Sectors per cluster  */
  uchar2 nrs;		/* Number of reserved sector  */
  uchar nf;		/* Number of FATs  */
  uchar2 nrd;		/* Number of root directory entries  */
  uchar2 ts16;		/* 16-bit total sector number  */
  uchar md;		/* Media  */
  uchar2 fz16;		/* 16-Bit FAT size  */
  uchar2 spt;		/* Sectors per track  */
  uchar2 nh;		/* Number of heads  */
  uchar4 nhs;		/* Number of hidden sectors  */
  uchar4 ts32;		/* 32-Bit total sectors  */
  uchar dn;		/* Drive number  */
  uchar r1;		/* Reserved field 1  */
  uchar ebs;		/* Extended boot sigature (0x29)  */
  uchar4 vn;		/* Volume serial number  */
  char vl[11];		/* Volume label  */
  char fs[8];		/* File system  */
  char bc[448];		/* Boot code  */
  uchar2 bss;		/* Boot sector sigature (0xAA55)  */
} PACK;

struct fat_bs32
